[
  {
    "id": "search_us_federal_statute_0_1754067856",
    "title": "29 CFR § 4.107 - Federal contracts.",
    "content": "29 CFR § 4.107 - Federal contracts. | Electronic Code of Federal Regulations (e-CFR) | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Electronic Code of Federal Regulations (e-CFR) Title 29—Labor Subtitle A—Office of the Secretary of Labor PART 4—LABOR STANDARDS FOR FEDERAL SERVICE CONTRACTS Subpart C—Application of the McNamara-O'Hara Service Contract Act Agencies Whose Contracts May Be Covered § 4.107 Federal contracts. 29 CFR § 4.107 - Federal contracts. CFR Table of Popular Names prev | next § 4.107 Federal contracts. (a) Section 2(a) of the Act covers contracts (and any bid specification therefor) “entered into by the United States” and section 2(b) applies to contracts entered into “with the Federal Government.” Within the meaning of these provisions, contracts entered into by the United States and contracts with the Federal Government include generally all contracts to which any agency or instrumentality of the U.S. Government becomes a party pursuant to authority derived from the Constitution and laws of the United States. The Act does not authorize any distinction in this respect between such agencies and instrumentalities on the basis of their inclusion in or independence from the executive, legislative, or judicial branches of the Government, the fact that they may be corporate in form, or the fact that payment for the contract services is not made from appropriated funds. Thus, contracts of wholly owned Government corporations, such as the Postal Service, and those of nonappropriated fund instrumentalities under the jurisdiction of the Armed Forces, or of other Federal agencies, such as Federal Reserve Banks, are included among those subject to the general coverage of the Act. (Brinks, Inc. v. Board of Governors of the Federal Reserve System, 466 F. Supp. 116 (D DC 1979); 43 Atty. Gen. Ops. ___ (September 26, 1978).) Contracts with the Federal Government and contracts entered into “by the United States” within the meaning of the Act do not, however, include contracts for services entered into on their own behalf by agencies or instrumentalities of other Governments within the United States, such as those of the several States and their political subdivisions, or of Puerto Rico, the Virgin Islands, Guam, or American Samoa. (b) Where a Federal agency exercises its contracting authority to procure services desired by the Government, the method of procurement utilized by the contracting agency is not controlling in determining coverage of the contract as one entered into by the United States. Such contracts may be entered into by the United States either through a direct award by a Federal agency or through the exercise by another agency (whether governmental or private) of authority granted to it to procure services for or on behalf of a Federal agency. Thus, sometimes authority to enter into service contracts of the character described in the Act for and on behalf of the Government and on a cost-reimbursable basis may be delegated, for the convenience of the contracting agency, to a prime contractor which has the responsibility for all work to be done in connection with the operation and management of a Federal plant, installation, facility, or program, together with the legal authority to act as agency for and on behalf of the Government and to obligate Government funds in the procurement of all services and supplies necessary to carry out the entire program of operation. The contracts entered into by such a prime contractor with secondary contractors for and on behalf of the Federal agency pursuant to such delegated authority, which have such services as their principal purpose, are deemed to be contracts entered into by the United States and contracts with the Federal Government within the meaning of the Act. However, service contracts entered into by State or local public bodies with purveyors of services are not deemed to be entered into by the United States merely because such services are paid for with funds of the public body which have been received from the Federal Government as a grant under a Federal program. For example, a contract entered into by a municipal housing authority for tree trimming, tree removal, and landscaping for an urban renewal project...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/cfr/text/29/4.107",
    "jurisdiction": "us_federal",
    "legal_domain": "contract_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal contract law statutes",
      "search_rank": 1,
      "snippet": "Such contracts may be entered into by the United States either through a direct award by a Federal agency or through the exercise by another agency (whether ..."
    },
    "created_at": "2025-08-01T17:04:16.732326",
    "content_hash": "c0c76a328cde535008904ff9bacd45bb"
  },
  {
    "id": "search_us_federal_statute_1_1754067856",
    "title": "U.S. Code: Title 41 — PUBLIC CONTRACTS - Law.Cornell.Edu",
    "content": "U.S. Code: Title 41 — PUBLIC CONTRACTS | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 41 Quick search by citation: Title Section Go! U.S. Code: Title 41 — PUBLIC CONTRACTS U.S. Code Notes prev | next Subtitle I—Federal Procurement Policy (§§ 101 – 4714) Subtitle II—Other Advertising and Contract Provisions (§§ 6101 – 6707) Subtitle III—Contract Disputes (§§ 7101 – 7109) Subtitle IV—Miscellaneous (§§ 8101 – 8707) This title was enacted by Pub. L. 111–350, § 3, Jan. 4, 2011, 124 Stat. 3677 Current through 119-4 Disposition Table (Showing Disposition of Former Sections of Title 41) Title 41 Former Sections Title 41 New Sections 1 to 4a (Previously repealed) 5, 5a 6101 6 (Previously repealed) 6a(a) 6102 6a(b) to (e) (Previously repealed) 6a(f) 6102 6a(g) (Previously repealed) 6a(h) 6102 6a(i) (Previously repealed) 6a(j) 6102 6a(k) to (n) (Previously repealed) 6a(o) (Omitted) 6a(p) (Previously repealed) 6a–1 6102 6a–2 T. 2 § 1816b 6a–3, 6a–4 6102 6b(a), (b) Rep. 6b(c) T. 25 § 903g 6b(d) 6102 6b(e) Rep. 6c to 6jj (Previously repealed) 6kk Rep. 6ll (Previously repealed) 6mm (Previously transferred to T. 41 § 6b(d) prior to repeal) 7 to 7d (Previously repealed) 8 6103 9 (Previously repealed) 10 Rep. 10a 8302 10b 8303 10b–1 (Previously omitted) 10b–2 8304 10b–3 8305 10c 8301 10d 8303 11, 11a, 12, 13 6301 to 6304 13a (Previously repealed) 14 6301 15 6305 16 (Previously repealed) 16a to 16d Rep. 17 to 21 (Previously repealed) 22 to 24 6306 to 6308 24a Rep. 25 to 27 (Previously repealed) 28 to 34 Rep. 35 (matter before subsec. (a) less words related to definition of “agency of the United States”) 6502 35 (matter before subsec. (a) related to definition of “agency of the United States”) 6501 35(a) to (d) 6502 36 6503 37 6504 38 to 40 6506 to 6508 41 6501 42 6511 43 6505 43a(a) 6509 43a(b) (1st sentence) 6507 43a(b) (last sentence), (c) 6509 43b 6510 44 Rep. 45 6502 46 to 48 8502 to 8504 48a 8505 48b 8501 48c 8506 49, 50 6309 51 Rep. 52 8701 53 8702 54 8707 55 8706 56 8705 57 8703 58 8704 101, 102(a) Rep. 102(b) (Previously repealed) 103 Rep. 104(a) (Previously repealed) 104(b) to 115 Rep. 116 (Previously repealed) 117, 118(a) Rep. 118(b) (Previously repealed) 118(c) to 125 Rep. 151 to 162 (Previously repealed) 201 to 205 (Previously transferred to T. 40 §§ 471 to 475 prior to repeal) 211 to 213 (Previously transferred to T. 40 §§ 751 to 753 prior to repeal) 214 (Previously transferred to T. 44 § 391 prior to repeal) 215 (Previously transferred to T. 5 § 630c prior to repeal) 216 (Previously transferred to T. 5 § 630d and T. 40 § 754 prior to repeal) 217 (Previously transferred to T. 5 § 630e and T. 40 § 755 prior to repeal) 218 (Previously transferred to T. 5 § 630f prior to repeal) 219 (Previously transferred to T. 5 § 630g and T. 40 § 756 prior to repeal) 231 to 237 (Previously transferred to T. 40 §§ 481 to 488 prior to repeal) 238 (Previously transferred to T. 5 § 630h and T. 40 § 758 prior to repeal) 239 to 240 (Previously transferred to T. 40 §§ 489 to 492 prior to repeal) 251 Rep. 251 note (Pub. L. 110–252, §§ 6102, 6103) 3509 251 note (Pub. L. 110–417, § 867) 4711 252(a) 3101 252(b) 3104 252(c)(1) 3106 252(c)(2) 3301 252a, 252b 3101 252c 4709 253(a) 3301 253(b) 3303 253(c) to (f) 3304 253(g) 3305 253(h) 3301 253(i) 3105 253(j) 3304 253a 3306 253a note (Pub. L. 108–136, § 1428) 3306 253b(a), (b) 3701 253b(c) to (f) 3702 to 3705 253b(g) (related to 41:253b(e)) 3704 253b(g) (related to 41:253b(f)) 3705 253b(h) 3706 253b(i) 3707 253b(j) 3308 253b(k), (l) 3708 253b(m) 4702 253c 3311 253d 4703 253e (Previously repealed) 253f 3310 253g 4704 253h 4103 253h note (Pub. L. 103–355, § 1054(b)) 4102 253h note (Pub. L. 106–65, § 804) 4104 253h note (Pub. L. 110–417, § 863(a)–(e)) 3302 253i 4105 253j 4106 253k 4101 253l 3902 253l–1 to 253l–8 3904 253m 3309 254(a) 3901 254(b) 3905 254 note (Pub. L. 110–417, § 864(a), (b), (d), (e), (f)(2), (g)) 3906 254a 4708 254b(a) to (g) 3502 to 3508 254b(h) 3501 254b note (Pub. L. 110–417, § 866) 4710 254b note (Pub. L. 110–417, § 868) 3501 254c 3903 254d 4706 255(a) 4501 255(b), (c) 4502 255(d) to (g) 4503 to 4506 256(a) to (d) 4303 256(e) to (k) 4304 to 4310 256(l)(1) 4301 256(l)(2) 4302 256(m) 4301 256a 4707 257 4701 258 (Prev...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/41",
    "jurisdiction": "us_federal",
    "legal_domain": "contract_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal contract law statutes",
      "search_rank": 2,
      "snippet": "U.S. Code: Title 41 — PUBLIC CONTRACTS · Subtitle I—Federal Procurement Policy (§§ 101 – 4714) · Subtitle II—Other Advertising and Contract Provisions (§§ 6101 – ..."
    },
    "created_at": "2025-08-01T17:04:16.978598",
    "content_hash": "b8518d25898aa1cdc8a9caa6d0a8cc16"
  },
  {
    "id": "search_us_federal_statute_2_1754067857",
    "title": "contract | Wex | US Law | LII / Legal Information Institute",
    "content": "contract | Wex | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Wex contract contractA contract is an agreement between parties, creating mutual obligations that are enforceable by law. The basic elements required for the agreement to be a legally enforceable contract are: mutual assent, expressed by a valid offer and acceptance; adequate consideration; capacity; and legality. In some states, elements of consideration can be satisfied by a valid substitute. Possible remedies for breach of contract include general damages, consequential damages, reliance damages, and specific performance.  Background:Contracts are promises that the law will enforce. Contract law is generally governed by state common law, and while general overall contract law is common throughout the country, some specific court interpretations of a particular element of the contract may vary between the states. If a promise is breached, the law provides remedies to the harmed party, often in the form of monetary damages, or in limited circumstances, in the form of specific performance of the promise made.  Elements -- Consideration and Mutual Assent Contracts arise when a duty comes into existence, because of a promise made by one of the parties. To be legally binding as a contract, a promise must be exchanged for adequate consideration. There are two different theories or definitions of consideration: Bargain Theory of Consideration and Benefit-Detriment theory of consideration. Benefit-DetrimentUnder the benefit-detriment theory, an adequate consideration exists only when a promise made to the benefit of the promisor or to the detriment of the promisee, which reasonably and fairly induces the promisor to make a promise for something else for the promisee.For example, promises that are purely gifts are not considered enforceable because the personal satisfaction the grantor of the promise may receive from the act of generosity is normally not considered sufficient detriment to constitute adequate consideration.   Bargain-for-ExchangeUnder Bargain-for-Exchange theory of consideration, adequate consideration exists when a promisor makes a promise in return for something else.Here, the essential condition is that the promisor was given something specifically to induce the promise being made.In other words, the bargain for exchange theory is different from the detriment-benefit theory in that the focus in bargain for exchange theory seems to be the parties’ motive for making the promises and the parties’ subjective mutual assent, while in detriment benefit theory, the focus seems to be an objective legal detriment or benefit to the parties.         Governing Laws                           Contracts are mainly governed by state statutory and common (judge-made) law and private law (i.e. the private agreement). Private law principally includes the terms of the agreement between the parties who are exchanging promises. This private law may override many of the rules otherwise established by state law. Statutory law, such as the Statute of Fraud, may require some kinds of contracts be put in writing and executed with particular formalities, for the contract to be enforceable. Otherwise, the parties may enter into a binding agreement without signing a formal written document. For example, Virginia Supreme Court has held in Lucy v. Zehmer that even an agreement made on a piece of napkin can be considered a valid contract, if the parties were both sane, and showed mutual assent and consideration.Most of the principles of the common law of contracts are outlined in the Restatement of Law, Second Contracts published by the American Law Institute. The Uniform Commercial Code, whose original articles have been adopted in nearly every state, represents a body of statutory law that governs important categories of contracts. The main articles that deal with the law of contracts are Article 1 (General Provisions) and Article 2 (Sales). Sections of Article 9 (Secured Transactions) govern contracts assigning the rights to payment in security interest agreements. Contracts related to particular activities or business sectors may be highly regulated by state and/or federal law. In 1988, the United States joined the United Nations ...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/wex/contract",
    "jurisdiction": "us_federal",
    "legal_domain": "contract_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal contract law statutes",
      "search_rank": 3,
      "snippet": "Statutory law, such as the Statute of Fraud, may require some kinds of contracts be put in writing and executed with particular formalities, for the contract to ..."
    },
    "created_at": "2025-08-01T17:04:17.170069",
    "content_hash": "640ca8df243e079b884c7bb23100359b"
  },
  {
    "id": "search_us_federal_statute_3_1754067857",
    "title": "government contracts | Wex - Law.Cornell.Edu",
    "content": "government contracts | Wex | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Wex government contracts government contractsThe United States Government is the single largest procurer of goods and services in the world, and the Department of Defense (DOD) accounts for the lion’s share of federal acquisitions. Regulations involving government contracts are found on Acquisitions.gov. Three major characteristics distinguish Government acquisitions from private sector contracts:Government contracts are subject to a myriad of statutes, regulations, and policies which encourage competition to the maximum extent practicable, ensure proper spending of taxpayer money, and advance socioeconomic goals.Government contracts contain mandatory clauses which afford the Government special contractual rights, the most important of these being the Changes clause, the Termination for Convenience clause, and the Default clause. These clauses give the government the right to unilaterally change contract terms and conditions or terminate the contract. Due to the Government’s special status as a sovereign entity, claims and litigation resulting from the government contract follow the unique procedures of the Contract Disputes Act. All government contracts are subject to the Federal Acquisition Streamlining Act which encourages the government to purchase already existing products rather than commission their own government exclusive goods when possible. Additionally, all government contracts are subject to the Federal Acquisition Regulation (FAR), which is codified in Parts 1 through 53 of Title 48, Chapter 1 of the Code of Federal Regulations. The FAR is amended pursuant to the Administrative Procedure Act, with proposed changes issued jointly by the DOD, the General Services Administration (GSA), and the National Aeronautics and Space Administration (NASA), in coordination with the FAR Council. In addition to the FAR, executive branch agencies may issue their own supplemental regulations such as the Defense Federal Acquisition Regulation Supplement (DFARS). Only contracting officers have the authority to contractually bind the United States Government. This authority is vested in the executive agency, which then delegates this authority by issuing a certificate of appointment or “warrant.” The warrant provides authority to bind the government up to a specified amount of money. As a result, contracting officers have the authority to award, administer, and terminate Government contracts. Government contract claims are subject to the Contract Disputes Act, which requires the claim to be presented first to the contracting officer.  After the Contracting Officer’s Final Decision, the claim may be appealed to either the United States Court of Federal Claims (CFC) or to one of the Boards of Contract Appeals. After either venue, the claim may be appealed to the United States Court of Appeals for the Federal Circuit, and finally to the Supreme Court. The General Accountability Office (GAO) has the authority to hear bid protests, which are challenges to an award, proposed award, or terms of a solicitation of a federal contract.Government contract claims are subject to the Contract Disputes Act, which requires the claim to be presented first to the contracting officer.  After the Contracting Officer’s Final Decision, the claim may be appealed to either the United States Court of Federal Claims (CFC) or to one of the Boards of Contract Appeals. After either venue, the claim may be appealed to the United States Court of Appeals for the Federal Circuit, and finally to the Supreme Court. The General Accountability Office (GAO) has the authority to hear bid protests, which are challenges to an award, proposed award, or terms of a solicitation of a federal contract.See also: 41 U.S.C.Title 41 C.F.R.Title 48 C.F.R. Federal Acquisition Regulations SystemFederal Acquisition Regulations[Last reviewed in January of 2023 by the Wex Definitions Team]WexCIVICS COMMERCE commercial activities wex articles contracts wex definitions business sectors commercial transactions government legal education and practice statutes Wex Toolbox Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/wex/government_contracts",
    "jurisdiction": "us_federal",
    "legal_domain": "contract_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal contract law statutes",
      "search_rank": 4,
      "snippet": "All government contracts are subject to the Federal Acquisition Streamlining Act which encourages the government to purchase already existing products."
    },
    "created_at": "2025-08-01T17:04:17.343000",
    "content_hash": "a45a28a1c8206007f95ba917285ca623"
  },
  {
    "id": "search_us_federal_statute_4_1754067857",
    "title": "18 U.S. Code Chapter 23 Part I - CONTRACTS | US Law",
    "content": "18 U.S. Code Chapter 23 Part I - CONTRACTS | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 18 PART I CHAPTER 23 Quick search by citation: Title Section Go! 18 U.S. Code Chapter 23 Part I - CONTRACTS U.S. Code Notes prev | next § 431. Contracts by Member of Congress § 432. Officer or employee contracting with Member of Congress § 433. Exemptions with respect to certain contracts [§ 434. Repealed. Pub. L. 87–849, § 2, Oct. 23, 1962, 76 Stat. 1126] § 435. Contracts in excess of specific appropriation § 436. Convict labor contracts [§ 437. Repealed. Pub. L. 104–178, § 1(a), Aug. 6, 1996, 110 Stat. 1565] [§§ 438, 439. Repealed. Pub. L. 106–568, title VIII, § 812(c)(2), Dec. 27, 2000, 114 Stat. 2917] § 440. Mail contracts § 441. Postal supply contracts § 442. Government Publishing Office § 443. War contracts Editorial Notes Amendments 2019—Pub. L. 116–78, § 1(b), Dec. 5, 2019, 133 Stat. 1176, substituted “Government Publishing Office” for “Printing contracts” in item 442. 1996—Pub. L. 104–178, § 1(b), Aug. 6, 1996, 110 Stat. 1565, struck out item 437 “Federal employees contracting or trading with Indians”. 1994—Pub. L. 103–322, title XXXIII, § 330010(13), Sept. 13, 1994, 108 Stat. 2144, struck out extraneous period after “Indians” in item 437. 1990—Pub. L. 101–647, title XXXV, § 3512, Nov. 29, 1990, 104 Stat. 4922, struck out item 434 “Interested persons acting as Government agents” and substituted “Federal employees contracting or trading with Indians.” for “Indian contracts for goods and supplies” in item 437. 1951—Act Oct. 31, 1951, ch. 655, § 18, 65 Stat. 717, struck out “; exceptions” from item 431. U.S. Code Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities How current is this? Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/18/part-I/chapter-23",
    "jurisdiction": "us_federal",
    "legal_domain": "contract_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal contract law statutes",
      "search_rank": 5,
      "snippet": "18 U.S. Code Chapter 23 Part I - CONTRACTS · § 431. Contracts by Member of Congress · § 432. Officer or employee contracting with Member of Congress · § 433."
    },
    "created_at": "2025-08-01T17:04:17.608450",
    "content_hash": "0c8aa38f057961023e60cd0c444a03c5"
  },
  {
    "id": "search_us_federal_statute_0_1754067858",
    "title": "29 U.S. Code Chapter 8 - FAIR LABOR STANDARDS",
    "content": "29 U.S. Code Chapter 8 - FAIR LABOR STANDARDS | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 29 CHAPTER 8 Quick search by citation: Title Section Go! 29 U.S. Code Chapter 8 - FAIR LABOR STANDARDS U.S. Code prev | next § 201. Short title § 202. Congressional finding and declaration of policy § 203. Definitions § 204. Administration § 205. Repealed. Pub. L. 110–28, title VIII, § 8103(c)(1)(A), May 25, 2007, 121 Stat. 189 § 206. Minimum wage § 207. Maximum hours § 208. Repealed. Pub. L. 110–28, title VIII, § 8103(c)(1)(A), May 25, 2007, 121 Stat. 189 § 209. Attendance of witnesses § 210. Court review of wage orders in Puerto Rico and the Virgin Islands § 211. Collection of data § 212. Child labor provisions § 213. Exemptions § 214. Employment under special certificates § 215. Prohibited acts; prima facie evidence § 216. Penalties § 216a. Repealed. Oct. 26, 1949, ch. 736, § 16(f), 63 Stat. 920 § 216b. Liability for overtime work performed prior to July 20, 1949 § 217. Injunction proceedings § 218. Relation to other laws § 218a. Repealed. Pub. L. 114–74, title VI, § 604, Nov. 2, 2015, 129 Stat. 599 § 218b. Notice to employees § 218c. Protections for employees § 218d. Breastfeeding accommodations in the workplace § 219. Separability U.S. Code Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities How current is this? Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/29/chapter-8",
    "jurisdiction": "us_federal",
    "legal_domain": "employment_labor_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal employment law regulations",
      "search_rank": 1,
      "snippet": "29 U.S. Code Chapter 8 - FAIR LABOR STANDARDS · § 201. Short title · § 202. Congressional finding and declaration of policy · § 203. Definitions · § 204."
    },
    "created_at": "2025-08-01T17:04:18.847739",
    "content_hash": "1632be01d5dfbf4caaa3412dacce87fd"
  },
  {
    "id": "search_us_federal_statute_1_1754067859",
    "title": "29 CFR § 783.7 - “Employer”, “employee”, and “employ”.",
    "content": "29 CFR § 783.7 - “Employer”, “employee”, and “employ”. | Electronic Code of Federal Regulations (e-CFR) | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Electronic Code of Federal Regulations (e-CFR) Title 29—Labor Subtitle B—Regulations Relating to Labor CHAPTER V—WAGE AND HOUR DIVISION, DEPARTMENT OF LABOR SUBCHAPTER B—STATEMENTS OF GENERAL POLICY OR INTERPRETATION NOT DIRECTLY RELATED TO REGULATIONS PART 783—APPLICATION OF THE FAIR LABOR STANDARDS ACT TO EMPLOYEES EMPLOYED AS SEAMEN Some Basic Definitions § 783.7 “Employer”, “employee”, and “employ”. 29 CFR § 783.7 - “Employer”, “employee”, and “employ”. CFR prev | next § 783.7 “Employer”, “employee”, and “employ”. The Act's major provisions impose certain requirements and prohibitions on every “employer” subject to their terms. The employment by an “employer” of an “employee” is, to the extent specified in the Act, made subject to minimum wage and overtime pay requirements and to prohibitions against the employment of oppressive child labor. The Act provides its own definitions of “employer”, “employee”, and “employ”, under which “economic reality” rather than “technical concepts” determines whether there is employment subject to its terms (Goldberg v. Whitaker House Cooperative, 366 U.S. 28; United States v. Silk, 331 U.S. 704; Rutherford Food Corp. v. McComb, 331 U.S. 772). An “employer”, as defined in section 3(d) of the Act, “includes any person acting directly or indirectly in the interest of an employer in relation to an employee but shall not include the United States or any State or political subdivision of a State, or any labor organization (other than when acting as an employer), or anyone acting in the capacity of officer or agent of such labor organization”. An “employee”, as defined in section 3(e) of the Act, “includes any individual employed by an employer”, and “employ”, as used in the Act, is defined in section 3(g) to include “to suffer or permit to work”. It should be noted, as explained in part 791 of this chapter, dealing with joint employment, that in appropriate circumstances two or more employers may be jointly responsible for compliance with the statutory requirements applicable to employment of a particular employee. It should also be noted that “employer”, “enterprise”, and “establishment” are not synonymous terms, as used in the Act. An employer may have an enterprise with more than one establishment, or he may have more than one enterprise, in which he employs employees within the meaning of the Act. Also, there may be different employers who employ employees in a particular establishment or enterprise. CFR Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/cfr/text/29/783.7",
    "jurisdiction": "us_federal",
    "legal_domain": "employment_labor_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal employment law regulations",
      "search_rank": 2,
      "snippet": "The employment by an “employer” of an “employee” is, to the extent specified in the Act, made subject to minimum wage and overtime pay requirements."
    },
    "created_at": "2025-08-01T17:04:19.036277",
    "content_hash": "48ce31f2951091f2f02dd21393550e4b"
  },
  {
    "id": "search_us_federal_statute_2_1754067859",
    "title": "42 U.S. Code § 410 - Definitions relating to employment",
    "content": "42 U.S. Code § 410 - Definitions relating to employment | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 42 CHAPTER 7 SUBCHAPTER II § 410 Quick search by citation: Title Section Go! 42 U.S. Code § 410 - Definitions relating to employment U.S. Code Notes Authorities (CFR) prev | next For the purposes of this subchapter— (a) EmploymentThe term “employment” means any service performed after 1936 and prior to 1951 which was employment for the purposes of this subchapter under the law applicable to the period in which such service was performed, and any service, of whatever nature, performed after 1950 (A) by an employee for the person employing him, irrespective of the citizenship or residence of either, (i) within the United States, or (ii) on or in connection with an American vessel or American aircraft under a contract of service which is entered into within the United States or during the performance of which and while the employee is employed on the vessel or aircraft it touches at a port in the United States, if the employee is employed on and in connection with such vessel or aircraft when outside the United States, or (B) outside the United States by a citizen or resident of the United States as an employee (i) of an American employer (as defined in subsection (e) of this section), or (ii) of a foreign affiliate (as defined in section 3121(l)(6) of the Internal Revenue Code of 1986) of an American employer during any period for which there is in effect an agreement, entered into pursuant to section 3121(l) of such Code, with respect to such affiliate, or (C) if it is service, regardless of where or by whom performed, which is designated as employment or recognized as equivalent to employment under an agreement entered into under section 433 of this title; except that, in the case of service performed after 1950, such term shall not include— (1) Service performed by foreign agricultural workers lawfully admitted to the United States from the Bahamas, Jamaica, and the other British West Indies, or from any other foreign country or possession thereof, on a temporary basis to perform agricultural labor; (2) Domestic service performed in a local college club, or local chapter of a college fraternity or sorority, by a student who is enrolled and is regularly attending classes at a school, college, or university; (3) (A) Service performed by a child under the age of 18 in the employ of his father or mother; (B) Service not in the course of the employer’s trade or business, or domestic service in a private home of the employer, performed by an individual under the age of 21 in the employ of his father or mother, or performed by an individual in the employ of his spouse or son or daughter; except that the provisions of this subparagraph shall not be applicable to such domestic service performed by an individual in the employ of his son or daughter if— (i) the employer is a surviving spouse or a divorced individual and has not remarried, or has a spouse living in the home who has a mental or physical condition which results in such spouse’s being incapable of caring for a son, daughter, stepson, or stepdaughter (referred to in clause (ii)) for at least 4 continuous weeks in the calendar quarter in which the service is rendered, and (ii) a son, daughter, stepson, or stepdaughter of such employer is living in the home, and (iii) the son, daughter, stepson, or stepdaughter (referred to in clause (ii)) has not attained age 18 or has a mental or physical condition which requires the personal care and supervision of an adult for at least 4 continuous weeks in the calendar quarter in which the service is rendered; (4) Service performed by an individual on or in connection with a vessel not an American vessel, or on or in connection with an aircraft not an American aircraft, if (A) the individual is employed on and in connection with such vessel or aircraft when outside the United States and (B)(i) such individual is not a citizen of the United States or (ii) the employer is not an American employer; (5) Service performed in the employ of the United States or any instrumentality of the United States, if such service— (A) would be excluded from the term “employme...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/42/410",
    "jurisdiction": "us_federal",
    "legal_domain": "employment_labor_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal employment law regulations",
      "search_rank": 3,
      "snippet": "The term “employment” shall, notwithstanding the provisions of subsection (a), include service performed by an individual as a volunteer or volunteer leader ..."
    },
    "created_at": "2025-08-01T17:04:19.361894",
    "content_hash": "8b4f24cb1db763a09dd471572aeaee3d"
  },
  {
    "id": "search_us_federal_statute_3_1754067859",
    "title": "U.S. Code: Title 29 — LABOR - Law.Cornell.Edu",
    "content": "U.S. Code: Title 29 — LABOR | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 29 Quick search by citation: Title Section Go! U.S. Code: Title 29 — LABOR U.S. Code prev | next CHAPTER 1—LABOR STATISTICS (§§ 1 – 9b) CHAPTER 2—WOMEN’S BUREAU (§§ 11 – 16) CHAPTER 2A—CHILDREN’S BUREAU (§ 18) CHAPTER 3—NATIONAL TRADE UNIONS (§ 21) CHAPTER 4—VOCATIONAL REHABILITATION OF PERSONS INJURED IN INDUSTRY (§§ 31 – 43) CHAPTER 4A—EMPLOYMENT STABILIZATION (§§ 48 – 48c) CHAPTER 4B—FEDERAL EMPLOYMENT SERVICE (§§ 49 – 49m) CHAPTER 4C—APPRENTICE LABOR (§§ 50 – 50c) CHAPTER 5—LABOR DISPUTES; MEDIATION AND INJUNCTIVE RELIEF (§§ 51 – 53) CHAPTER 6—JURISDICTION OF COURTS IN MATTERS AFFECTING EMPLOYER AND EMPLOYEE (§§ 101 – 115) CHAPTER 7—LABOR-MANAGEMENT RELATIONS (§§ 141 – 191) CHAPTER 8—FAIR LABOR STANDARDS (§§ 201 – 219) CHAPTER 9—PORTAL-TO-PORTAL PAY (§§ 251 – 262) CHAPTER 10—DISCLOSURE OF WELFARE AND PENSION PLANS (§ 301) CHAPTER 11—LABOR-MANAGEMENT REPORTING AND DISCLOSURE PROCEDURE (§§ 401 – 531) CHAPTER 12—DEPARTMENT OF LABOR (§§ 551 – 568) CHAPTER 13—EXEMPLARY REHABILITATION CERTIFICATES (§§ 601 – 607) CHAPTER 14—AGE DISCRIMINATION IN EMPLOYMENT (§§ 621 – 634) CHAPTER 15—OCCUPATIONAL SAFETY AND HEALTH (§§ 651 – 678) CHAPTER 16—VOCATIONAL REHABILITATION AND OTHER REHABILITATION SERVICES (§§ 701 – 797) CHAPTER 17—COMPREHENSIVE EMPLOYMENT AND TRAINING PROGRAMS (§§ 801 – 991) CHAPTER 18—EMPLOYEE RETIREMENT INCOME SECURITY PROGRAM (§§ 1001 – 1461) CHAPTER 19—JOB TRAINING PARTNERSHIP (§§ 1501 – 1792) CHAPTER 20—MIGRANT AND SEASONAL AGRICULTURAL WORKER PROTECTION (§§ 1801 – 1872) CHAPTER 21—HELEN KELLER NATIONAL CENTER FOR YOUTHS AND ADULTS WHO ARE DEAF-BLIND (§§ 1901 – 1908) CHAPTER 22—EMPLOYEE POLYGRAPH PROTECTION (§§ 2001 – 2009) CHAPTER 23—WORKER ADJUSTMENT AND RETRAINING NOTIFICATION (§§ 2101 – 2109) CHAPTER 24—TECHNOLOGY RELATED ASSISTANCE FOR INDIVIDUALS WITH DISABILITIES (§§ 2201 – 2281) CHAPTER 25—DISPLACED HOMEMAKERS SELF-SUFFICIENCY ASSISTANCE (§ 2301) CHAPTER 26—NATIONAL CENTER FOR THE WORKPLACE (§ 2401) CHAPTER 27—WOMEN IN APPRENTICESHIP AND NONTRADITIONAL OCCUPATIONS (§§ 2501 – 2509) CHAPTER 28—FAMILY AND MEDICAL LEAVE (§§ 2601 – 2654) CHAPTER 29—WORKERS TECHNOLOGY SKILL DEVELOPMENT (§§ 2701 – 2706) CHAPTER 30—WORKFORCE INVESTMENT SYSTEMS (§§ 2801 – 2931) CHAPTER 31—ASSISTIVE TECHNOLOGY FOR INDIVIDUALS WITH DISABILITIES (§§ 3001 – 3051) CHAPTER 32—WORKFORCE INNOVATION AND OPPORTUNITY (§§ 3101 – 3361) U.S. Code Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities How current is this? Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/29",
    "jurisdiction": "us_federal",
    "legal_domain": "employment_labor_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal employment law regulations",
      "search_rank": 4,
      "snippet": "U.S. Code: Title 29 — LABOR · CHAPTER 1—LABOR STATISTICS (§§ 1 – 9b) · CHAPTER 2—WOMEN'S BUREAU (§§ 11 – 16) · CHAPTER 2A—CHILDREN'S BUREAU (§ 18) · CHAPTER 3— ..."
    },
    "created_at": "2025-08-01T17:04:19.529240",
    "content_hash": "d2bc9f72ff46fb1995a820de674d98c8"
  },
  {
    "id": "search_us_federal_statute_4_1754067859",
    "title": "employment | Wex | US Law | LII / Legal Information Institute",
    "content": "employment | Wex | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Wex employment employmentEmployment is the condition of labor provided by an employee in exchange for payment by an employer. Employment law is a broad area encompassing the rights and responsibilities of the employer/employee relationship. Employment law consists of federal and state statutes, administrative regulations, and judicial decisions. Many employment laws were enacted as protective labor legislation intended for the fairness of both employers and employees, like employment discrimination or OSHA regulations. Other employment laws act as public benefits, such as unemployment compensation. Additionally, post-employment retirement benefits, like pensions, are regulated by employment legislation.Federal Statutes29 U.S. Code - Labor. Chapters pertinent to employment:Chapt. 8. Fair Labor StandardsChapt. 14. Age Discrimination in EmploymentChapt. 15. Occupational Safety and HealthChapt. 16. Vocational Rehabilitation and Other Rehabilitation ServicesChapt. 18. Employee Retirement Income Security Program (ERISA)Chapt. 20. Migrant and Seasonal Agricultural Worker ProtectionChapt. 22. Employee Polygraph ProtectionChapt. 24. Technology Related Assistance for Individuals With DisabilitiesChapt. 28. Family and Medical Leave42 U.S. Code - The Public Health and Welfare. Chapters pertinent to employment:Chapter 21. The Civil Rights Act§§ 2000e - 2000e-17 - Equal Employment Opportunity§§ 1981, 1981A, 1983, & 1988 - Employment DiscriminationChapter 126. - Equal Opportunity for Individuals with Disabilities[Last reviewed in March of 2025 by the Wex Definitions Team]Keywordsemployment law labor law UNEMPLOYMENT BENEFITS PENSIONS Pension PlansWexLIFE EVENTS employment employee benefits labor law wex articles employment law Wex Toolbox Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/wex/employment",
    "jurisdiction": "us_federal",
    "legal_domain": "employment_labor_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal employment law regulations",
      "search_rank": 5,
      "snippet": "Employment law consists of federal and state statutes, administrative regulations, and judicial decisions. Many employment laws were enacted as protective labor ..."
    },
    "created_at": "2025-08-01T17:04:19.829072",
    "content_hash": "126162035675be830f8dd95d8339a61f"
  },
  {
    "id": "search_us_federal_statute_1_1754067861",
    "title": "chapter 107 —protection of intellectual property rights",
    "content": "15 USC Ch. 107: PROTECTION OF INTELLECTUAL PROPERTY RIGHTS Result 1 of 1 Current 2024 Main Ed. (1/6/2025) [Titles 1 through 15] 2018 Ed. and Supplement V (1/3/2024) 2018 Ed. and Supplement IV (1/5/2023) 2018 Ed. and Supplement III (1/3/2022) 2018 Ed. and Supplement II (1/13/2021) 2018 Ed. and Supplement I (1/24/2020) 2018 Main Ed. (1/14/2019) 2012 Ed. and Supplement V (1/12/2018) 2012 Ed. and Supplement IV (1/6/2017) 2012 Ed. and Supplement III (1/3/2016) 2012 Ed. and Supplement II (1/5/2015) 2012 Ed. and Supplement I (1/16/2014) 2012 Main Ed. (1/15/2013) 2006 Ed. and Supplement V (1/3/2012) 2006 Ed. and Supplement IV (1/7/2011) 2006 Ed. and Supplement III (2/1/2010) 2006 Ed. and Supplement II (1/5/2009) 2006 Ed. and Supplement I (1/8/2008) 2006 Main Ed. (1/3/2007) 2000 Ed. and Supplement V (1/2/2006) 2000 Ed. and Supplement IV (1/3/2005) 2000 Ed. and Supplement III (1/19/2004) 2000 Ed. and Supplement II (1/6/2003) 2000 Ed. and Supplement I (1/22/2002) 2000 Main Ed. (1/2/2001) 1994 Ed. and Supplement V (1/23/2000) 1994 Ed. and Supplement IV (1/5/1999) 1994 Ed. and Supplement III (1/26/1998) 1994 Ed. and Supplement II (1/6/1997) 1994 Ed. and Supplement I (1/16/1996) 1994 Main Ed. (1/4/1995) Back to Original DocumentBack to Original Document << Previous TITLE 15 / CHAPTER 107 Next >> [Print] [Print selection] [OLRC Home]Help 15 USC Ch. 107: PROTECTION OF INTELLECTUAL PROPERTY RIGHTS From Title 15—COMMERCE AND TRADE CHAPTER 107—PROTECTION OF INTELLECTUAL PROPERTY RIGHTS Sec. 8101.Definition. SUBCHAPTER I—COORDINATION AND STRATEGIC PLANNING OF FEDERAL EFFORT AGAINST COUNTERFEITING AND INFRINGEMENT 8111.Intellectual Property Enforcement Coordinator. 8112.Definition. 8113.Joint Strategic Plan. 8114.Reporting. 8115.Savings and repeals. 8116.Authorization of appropriations. SUBCHAPTER II—CYBERSQUATTING PROTECTION 8131.Cyberpiracy protections for individuals. §8101. Definition In this Act, the term \"United States person\" means— (1) any United States resident or national, (2) any domestic concern (including any permanent domestic establishment of any foreign concern), and (3) any foreign subsidiary or affiliate (including any permanent foreign establishment) of any domestic concern that is controlled in fact by such domestic concern, except that such term does not include an individual who resides outside the United States and is employed by an individual or entity other than an individual or entity described in paragraph (1), (2), or (3). (Pub. L. 110–403, §3, Oct. 13, 2008, 122 Stat. 4257.) References in Text This Act, referred to in text, is Pub. L. 110–403, Oct. 13, 2008, 122 Stat. 4256, known as the Prioritizing Resources and Organization for Intellectual Property Act of 2008, which enacted this chapter and enacted, amended, and repealed numerous other sections and notes in the Code. For complete classification of this Act to the Code, see Short Title note below and Tables. Short Title Pub. L. 110–403, §1(a), Oct. 13, 2008, 122 Stat. 4256, provided that: \"This Act [enacting this chapter, section 2323 of Title 18, Crimes and Criminal Procedure, and sections 3713a to 3713d of Title 42, The Public Health and Welfare, amending sections 1116 and 1117 of this title, sections 109, 111, 115, 119, 122, 411, 412, 503, 506, 601, and 602 of Title 17, Copyrights, sections 1834 and 2318 to 2320 of Title 18, section 1595a of Title 19, Customs Duties, and section 3713 of Title 42, and repealing section 1128 of this title and section 509 of Title 17] may be cited as the 'Prioritizing Resources and Organization for Intellectual Property Act of 2008'.\" SUBCHAPTER I—COORDINATION AND STRATEGIC PLANNING OF FEDERAL EFFORT AGAINST COUNTERFEITING AND INFRINGEMENT §8111. Intellectual Property Enforcement Coordinator (a) Intellectual Property Enforcement Coordinator The President shall appoint, by and with the advice and consent of the Senate, an Intellectual Property Enforcement Coordinator (in this subchapter referred to as the \"IPEC\") to serve within the Executive Office of the President. As an exercise of the rulemaking power of the Senate, any nomination of the IPEC submitted to the Senate for confirmation, and referred to a committee, shall be referred to the Committee on the Judiciary. (b) Duties of IPEC (1) In general The IPEC shall— (A) chair the interagency intellectual property enforcement advisory committee established under subsection (b)(3)(A); (B) coordinate the development of the Joint Strategic Plan against counterfeiting and infringement by the advisory committee under section 8113 of this title; (C) assist, at the request of the departments and agencies listed in subsection (b)(3)(A), in the implementation of the Joint Strategic Plan; (D) facilitate the issuance of policy guidance to departments and agencies on basic issues of policy and interpretation, to the extent necessary to assure the coordination of intellectual property enforcement policy and consistency with other law; (E) report to the President and report to ...",
    "source": "Web Search",
    "source_url": "https://uscode.house.gov/view.xhtml;jsessionid=D87872FD147196D865D791C4D5496F05?req=granuleid%3AUSC-2010-title15-chapter107&saved=%7CZ3JhbnVsZWlkOlVTQy0yMDEwLXRpdGxlMTUtc2VjdGlvbjgxMDE%3D%7C%7C%7C0%7Cfalse%7C2010&edition=2010",
    "jurisdiction": "us_federal",
    "legal_domain": "intellectual_property",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:uscode.house.gov intellectual property laws",
      "search_rank": 2,
      "snippet": "CHAPTER 107 —PROTECTION OF INTELLECTUAL PROPERTY RIGHTS ... (1) the investigation and prosecution of violations of laws that protect intellectual property rights;."
    },
    "created_at": "2025-08-01T17:04:21.445673",
    "content_hash": "7553556ff49d06838cf5f9d3240b328f"
  },
  {
    "id": "search_us_federal_statute_2_1754067862",
    "title": "10 USC 1707: Cadre of intellectual property experts",
    "content": "10 USC 1707: Cadre of intellectual property experts Result 1 of 1 Current 2024 Main Ed. (1/6/2025) [Titles 1 through 15] 2018 Ed. and Supplement V (1/3/2024) 2018 Ed. and Supplement IV (1/5/2023) 2018 Ed. and Supplement III (1/3/2022) 2018 Ed. and Supplement II (1/13/2021) 2018 Ed. and Supplement I (1/24/2020) 2018 Main Ed. (1/14/2019) 2012 Ed. and Supplement V (1/12/2018) 2012 Ed. and Supplement IV (1/6/2017) 2012 Ed. and Supplement III (1/3/2016) 2012 Ed. and Supplement II (1/5/2015) 2012 Ed. and Supplement I (1/16/2014) 2012 Main Ed. (1/15/2013) 2006 Ed. and Supplement V (1/3/2012) 2006 Ed. and Supplement IV (1/7/2011) 2006 Ed. and Supplement III (2/1/2010) 2006 Ed. and Supplement II (1/5/2009) 2006 Ed. and Supplement I (1/8/2008) 2006 Main Ed. (1/3/2007) 2000 Ed. and Supplement V (1/2/2006) 2000 Ed. and Supplement IV (1/3/2005) 2000 Ed. and Supplement III (1/19/2004) 2000 Ed. and Supplement II (1/6/2003) 2000 Ed. and Supplement I (1/22/2002) 2000 Main Ed. (1/2/2001) 1994 Ed. and Supplement V (1/23/2000) 1994 Ed. and Supplement IV (1/5/1999) 1994 Ed. and Supplement III (1/26/1998) 1994 Ed. and Supplement II (1/6/1997) 1994 Ed. and Supplement I (1/16/1996) 1994 Main Ed. (1/4/1995) Back to Original Document << Previous TITLE 10 / Subtitle A / PART II / CHAPTER 87 / SUBCHAPTER I / § 1707 Next >> [Print] [Print selection] [OLRC Home]Help 10 USC 1707: Cadre of intellectual property experts Text contains those laws in effect on July 31, 2025 From Title 10-ARMED FORCESSubtitle A-General Military LawPART II-PERSONNELCHAPTER 87-DEFENSE ACQUISITION WORKFORCESUBCHAPTER I-GENERAL AUTHORITIES AND RESPONSIBILITIES Jump To: Source CreditMiscellaneousPrior ProvisionsCodificationAmendmentsEffective Date §1707. Cadre of intellectual property experts (a) Cadre.-The Secretary of Defense, acting through the Under Secretary of Defense for Acquisition and Sustainment, shall establish a cadre of personnel who are experts in intellectual property matters. The purpose of the cadre is to ensure a consistent, strategic, and highly knowledgeable approach to acquiring or licensing intellectual property by providing expert advice, assistance, and resources to the acquisition workforce on intellectual property matters, including acquiring or licensing intellectual property. (b) Leadership Structure.-The Under Secretary- (1) shall establish an appropriate leadership structure and office within which the cadre shall be managed; and (2) shall determine the appropriate official to whom members of the cadre shall report. (c) Duties.-The cadre of experts shall be assigned to a program office or an acquisition command within a military department to advise, assist, and provide resources to a program manager or program executive officer on intellectual property matters at various stages of the life cycle of a system. In performing such duties, the experts shall- (1) interpret and provide counsel on laws, regulations, and policies relating to intellectual property; (2) advise and assist in the development of an acquisition strategy, product support strategy, and intellectual property strategy for a system; (3) conduct or assist with financial analysis and valuation of intellectual property; (4) assist in the drafting of a solicitation, contract, or other transaction; (5) interact with or assist in interactions with contractors, including communications and negotiations with contractors on solicitations and awards; and (6) conduct or assist with mediation if technical data delivered pursuant to a contract is incomplete or does not comply with the terms of agreements. (d) Administration.- (1) In order to achieve the purpose set forth in subsection (a), the Under Secretary shall ensure the cadre has the appropriate number of staff and such staff possesses the necessary skills, knowledge, and experience to carry out the duties under subsection (b), including in relevant areas of law, contracting, acquisition, logistics, engineering, financial analysis, and valuation. The Under Secretary, in coordination with the Defense Acquisition University and in consultation with academia and industry, shall develop a career path, including development opportunities, exchanges, talent management programs, and training, for the cadre. The Under Secretary may use existing authorities to staff the cadre, including those in paragraphs (2), (3), (4), and (6). (2) Civilian personnel from within the Office of the Secretary of Defense, Joint Staff, military departments, Defense Agencies, and combatant commands may be assigned to serve as members of the cadre, upon request of the Director. (3) The Under Secretary may use the authorities for highly qualified experts under section 9903 of title 5, to hire experts as members of the cadre who are skilled professionals in intellectual property and related matters. (4) The Under Secretary may enter into a contract with a private-sector entity for specialized expertise to support the cadre. Such entity may be considered a cove...",
    "source": "Web Search",
    "source_url": "https://uscode.house.gov/view.xhtml?req=%28title:10%20section:1707%20edition:prelim%29%20OR%20%28granuleid:USC-prelim-title10-section1707%29&f=treesort&edition=prelim&num=0&jumpTo=true",
    "jurisdiction": "us_federal",
    "legal_domain": "intellectual_property",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:uscode.house.gov intellectual property laws",
      "search_rank": 3,
      "snippet": "(1) interpret and provide counsel on laws, regulations, and policies relating to intellectual property;. (2) advise and assist in the development of an ..."
    },
    "created_at": "2025-08-01T17:04:22.106795",
    "content_hash": "8aef4c633cc81f8511818714a7d664b2"
  },
  {
    "id": "search_us_federal_statute_3_1754067862",
    "title": "15 USC 8111: Intellectual Property Enforcement Coordinator",
    "content": "15 USC 8111: Intellectual Property Enforcement Coordinator Result 1 of 1 Current 2024 Main Ed. (1/6/2025) [Titles 1 through 15] 2018 Ed. and Supplement V (1/3/2024) 2018 Ed. and Supplement IV (1/5/2023) 2018 Ed. and Supplement III (1/3/2022) 2018 Ed. and Supplement II (1/13/2021) 2018 Ed. and Supplement I (1/24/2020) 2018 Main Ed. (1/14/2019) 2012 Ed. and Supplement V (1/12/2018) 2012 Ed. and Supplement IV (1/6/2017) 2012 Ed. and Supplement III (1/3/2016) 2012 Ed. and Supplement II (1/5/2015) 2012 Ed. and Supplement I (1/16/2014) 2012 Main Ed. (1/15/2013) 2006 Ed. and Supplement V (1/3/2012) 2006 Ed. and Supplement IV (1/7/2011) 2006 Ed. and Supplement III (2/1/2010) 2006 Ed. and Supplement II (1/5/2009) 2006 Ed. and Supplement I (1/8/2008) 2006 Main Ed. (1/3/2007) 2000 Ed. and Supplement V (1/2/2006) 2000 Ed. and Supplement IV (1/3/2005) 2000 Ed. and Supplement III (1/19/2004) 2000 Ed. and Supplement II (1/6/2003) 2000 Ed. and Supplement I (1/22/2002) 2000 Main Ed. (1/2/2001) 1994 Ed. and Supplement V (1/23/2000) 1994 Ed. and Supplement IV (1/5/1999) 1994 Ed. and Supplement III (1/26/1998) 1994 Ed. and Supplement II (1/6/1997) 1994 Ed. and Supplement I (1/16/1996) 1994 Main Ed. (1/4/1995) Back to Original Document << Previous TITLE 15 / CHAPTER 107 / SUBCHAPTER I / § 8111 Next >> [Print] [Print selection] [OLRC Home]Help 15 USC 8111: Intellectual Property Enforcement Coordinator Text contains those laws in effect on July 31, 2025 From Title 15-COMMERCE AND TRADECHAPTER 107-PROTECTION OF INTELLECTUAL PROPERTY RIGHTSSUBCHAPTER I-COORDINATION AND STRATEGIC PLANNING OF FEDERAL EFFORT AGAINST COUNTERFEITING AND INFRINGEMENT Jump To: Source CreditMiscellaneousReferences In TextExecutive Documents §8111. Intellectual Property Enforcement Coordinator (a) Intellectual Property Enforcement Coordinator The President shall appoint, by and with the advice and consent of the Senate, an Intellectual Property Enforcement Coordinator (in this subchapter referred to as the \"IPEC\") to serve within the Executive Office of the President. As an exercise of the rulemaking power of the Senate, any nomination of the IPEC submitted to the Senate for confirmation, and referred to a committee, shall be referred to the Committee on the Judiciary. (b) Duties of IPEC (1) In general The IPEC shall- (A) chair the interagency intellectual property enforcement advisory committee established under subsection (b)(3)(A); (B) coordinate the development of the Joint Strategic Plan against counterfeiting and infringement by the advisory committee under section 8113 of this title; (C) assist, at the request of the departments and agencies listed in subsection (b)(3)(A), in the implementation of the Joint Strategic Plan; (D) facilitate the issuance of policy guidance to departments and agencies on basic issues of policy and interpretation, to the extent necessary to assure the coordination of intellectual property enforcement policy and consistency with other law; (E) report to the President and report to Congress, to the extent consistent with law, regarding domestic and international intellectual property enforcement programs; (F) report to Congress, as provided in section 8114 of this title, on the implementation of the Joint Strategic Plan, and make recommendations, if any and as appropriate, to Congress for improvements in Federal intellectual property laws and enforcement efforts; and (G) carry out such other functions as the President may direct. (2) Limitation on authority The IPEC may not control or direct any law enforcement agency, including the Department of Justice, in the exercise of its investigative or prosecutorial authority. (3) Advisory committee (A) Establishment There is established an interagency intellectual property enforcement advisory committee composed of the IPEC, who shall chair the committee, and the following members: (i) Senate-confirmed representatives of the following departments and agencies who are involved in intellectual property enforcement, and who are, or are appointed by, the respective heads of those departments and agencies: (I) The Office of Management and Budget. (II) Relevant units within the Department of Justice, including the Federal Bureau of Investigation and the Criminal Division. (III) The United States Patent and Trademark Office and other relevant units of the Department of Commerce. (IV) The Office of the United States Trade Representative. (V) The Department of State, the United States Agency for International Development, and the Bureau of International Narcotics Law Enforcement. (VI) The Department of Homeland Security, United States Customs and Border Protection, and United States Immigration and Customs Enforcement. (VII) The Food and Drug Administration of the Department of Health and Human Services. (VIII) The Department of Agriculture. (IX) Any such other agencies as the President determines to be substantially involved in the efforts of the Federal Government to combat counterfeiting...",
    "source": "Web Search",
    "source_url": "http://uscode.house.gov/view.xhtml?req=(title:15%20section:8111%20edition:prelim)",
    "jurisdiction": "us_federal",
    "legal_domain": "intellectual_property",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:uscode.house.gov intellectual property laws",
      "search_rank": 4,
      "snippet": "The President shall appoint, by and with the advice and consent of the Senate, an Intellectual Property Enforcement Coordinator (in this subchapter referred to ..."
    },
    "created_at": "2025-08-01T17:04:22.530347",
    "content_hash": "a7914f1ca9ea91585f31f9870785f05a"
  },
  {
    "id": "search_us_federal_statute_4_1754067863",
    "title": "28 USC 1338: Patents, plant variety protection, copyrights ...",
    "content": "28 USC 1338: Patents, plant variety protection, copyrights, mask works, designs, trademarks, and unfair competition Result 1 of 1 Current 2024 Main Ed. (1/6/2025) [Titles 1 through 15] 2018 Ed. and Supplement V (1/3/2024) 2018 Ed. and Supplement IV (1/5/2023) 2018 Ed. and Supplement III (1/3/2022) 2018 Ed. and Supplement II (1/13/2021) 2018 Ed. and Supplement I (1/24/2020) 2018 Main Ed. (1/14/2019) 2012 Ed. and Supplement V (1/12/2018) 2012 Ed. and Supplement IV (1/6/2017) 2012 Ed. and Supplement III (1/3/2016) 2012 Ed. and Supplement II (1/5/2015) 2012 Ed. and Supplement I (1/16/2014) 2012 Main Ed. (1/15/2013) 2006 Ed. and Supplement V (1/3/2012) 2006 Ed. and Supplement IV (1/7/2011) 2006 Ed. and Supplement III (2/1/2010) 2006 Ed. and Supplement II (1/5/2009) 2006 Ed. and Supplement I (1/8/2008) 2006 Main Ed. (1/3/2007) 2000 Ed. and Supplement V (1/2/2006) 2000 Ed. and Supplement IV (1/3/2005) 2000 Ed. and Supplement III (1/19/2004) 2000 Ed. and Supplement II (1/6/2003) 2000 Ed. and Supplement I (1/22/2002) 2000 Main Ed. (1/2/2001) 1994 Ed. and Supplement V (1/23/2000) 1994 Ed. and Supplement IV (1/5/1999) 1994 Ed. and Supplement III (1/26/1998) 1994 Ed. and Supplement II (1/6/1997) 1994 Ed. and Supplement I (1/16/1996) 1994 Main Ed. (1/4/1995) Back to Original Document << Previous TITLE 28 / PART IV / CHAPTER 85 / § 1338 Next >> [Print] [Print selection] [OLRC Home]Help 28 USC 1338: Patents, plant variety protection, copyrights, mask works, designs, trademarks, and unfair competition Text contains those laws in effect on July 31, 2025 From Title 28-JUDICIARY AND JUDICIAL PROCEDUREPART IV-JURISDICTION AND VENUECHAPTER 85-DISTRICT COURTS; JURISDICTION Jump To: Source CreditMiscellaneousAmendmentsEffective Date §1338. Patents, plant variety protection, copyrights, mask works, designs, trademarks, and unfair competition (a) The district courts shall have original jurisdiction of any civil action arising under any Act of Congress relating to patents, plant variety protection, copyrights and trademarks. No State court shall have jurisdiction over any claim for relief arising under any Act of Congress relating to patents, plant variety protection, or copyrights. For purposes of this subsection, the term \"State\" includes any State of the United States, the District of Columbia, the Commonwealth of Puerto Rico, the United States Virgin Islands, American Samoa, Guam, and the Northern Mariana Islands. (b) The district courts shall have original jurisdiction of any civil action asserting a claim of unfair competition when joined with a substantial and related claim under the copyright, patent, plant variety protection or trademark laws. (c) Subsections (a) and (b) apply to exclusive rights in mask works under chapter 9 of title 17, and to exclusive rights in designs under chapter 13 of title 17, to the same extent as such subsections apply to copyrights. (June 25, 1948, ch. 646, 62 Stat. 931 ; Pub. L. 91–577, title III, §143(b), Dec. 24, 1970, 84 Stat. 1559 ; Pub. L. 100–702, title X, §1020(a)(4), Nov. 19, 1988, 102 Stat. 4671 ; Pub. L. 105–304, title V, §503(b)(1), (2)(A), Oct. 28, 1998, 112 Stat. 2917 ; Pub. L. 106–113, div. B, §1000(a)(9) [title III, §3009(1)], Nov. 29, 1999, 113 Stat. 1536 , 1501A-551; Pub. L. 112–29, §19(a), Sept. 16, 2011, 125 Stat. 331 .) Historical and Revision Notes Based on title 28, U.S.C., 1940 ed., §§41(7) and 371(5) (Mar. 3, 1911, ch. 231, §§24, par. 7, 256, par. 5, 36 Stat. 1092 , 1160). Section consolidates section 41(7) with section 371 (5) of title 28, U.S.C., 1940 ed., with necessary changes in phraseology. Words \"of any civil action\" were substituted for \"all suits at law or in equity\" and \"cases\" to conform section to Rule 2 of the Federal Rules of Civil Procedure. Word \"patents\" was substituted for \"patent-right\" in said section 371 (Fifth) of title 28, U.S.C., 1940 ed. Similar provisions respecting suits cognizable in district courts, including those of territories and possessions. (See section 34 of title 17, U.S.C., 1940 ed., Copyrights.) Subsection (b) is added and is intended to avoid \"piecemeal\" litigation to enforce common-law and statutory copyright, patent, and trade-mark rights by specifically permitting such enforcement in a single civil action in the district court. While this is the rule under Federal decisions, this section would enact it as statutory authority. The problem is discussed at length in Hurn v. Oursler (1933, 53 S.Ct. 586, 289 U.S. 238, 77 L.Ed. 1148) and in Musher Foundation v. Alba Trading Co. (C.C.A. 1942, 127 F.2d 9) (majority and dissenting opinions). Editorial Notes Amendments 2011-Subsec. (a). Pub. L. 112–29 substituted \"No State court shall have jurisdiction over any claim for relief arising under any Act of Congress relating to patents, plant variety protection, or copyrights. For purposes of this subsection, the term 'State' includes any State of the United States, the District of Columbia, the Commonwealth of Puerto Rico, the United States V...",
    "source": "Web Search",
    "source_url": "https://uscode.house.gov/view.xhtml?req=(title:28%20section:1338%20edition:prelim)%20OR%20(granuleid:USC-prelim-title28-section1338)&f=treesort&edition=prelim&num=0&jumpTo=true",
    "jurisdiction": "us_federal",
    "legal_domain": "intellectual_property",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:uscode.house.gov intellectual property laws",
      "search_rank": 5,
      "snippet": "No State court shall have jurisdiction over any claim for relief arising under any Act of Congress relating to patents, plant variety protection, or copyrights."
    },
    "created_at": "2025-08-01T17:04:23.192203",
    "content_hash": "c14e12d93983cc63908fc2d403e91041"
  },
  {
    "id": "search_us_federal_statute_0_1754067864",
    "title": "17 CFR Part 230 - GENERAL RULES AND REGULATIONS ...",
    "content": "17 CFR Part 230 - GENERAL RULES AND REGULATIONS, SECURITIES ACT OF 1933 | Electronic Code of Federal Regulations (e-CFR) | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Electronic Code of Federal Regulations (e-CFR) Title 17—Commodity and Securities Exchanges CHAPTER II—SECURITIES AND EXCHANGE COMMISSION PART 230—GENERAL RULES AND REGULATIONS, SECURITIES ACT OF 1933 17 CFR Part 230 - GENERAL RULES AND REGULATIONS, SECURITIES ACT OF 1933 CFR prev | next General (§ - ) § 230.100 Definitions of terms used in the rules and regulations. § 230.110 Business hours of the Commission. § 230.111 Payment of filing fees. § 230.120 Inspection of registration statements. § 230.122 Non-disclosure of information obtained in the course of examinations and investigations. § 230.130 Definition of “rules and regulations” as used in certain sections of the Act. § 230.131 Definition of security issued under governmental obligations. § 230.132 Definition of “common trust fund” as used in section 3(a)(2) of the Act. § 230.133 Definition for purposes of section 5 of the Act, of “sale”, “offer”, “offer to sell”, and “offer for sale”. § 230.134 Communications not deemed a prospectus. § 230.134a Options material not deemed a prospectus. § 230.134b Statements of additional information. § 230.135 Notice of proposed registered offerings. § 230.135a Generic advertising. § 230.135b Materials not deemed an offer to sell or offer to buy nor a prospectus. § 230.135c Notice of certain proposed unregistered offerings. § 230.135d Communications involving security-based swaps. § 230.135e Offshore press conferences, meetings with issuer representatives conducted offshore, and press-related materials released offshore. § 230.136 Definition of certain terms in relation to assessable stock. § 230.137 Publications or distributions of research reports by brokers or dealers that are not participating in an issuer's registered distribution of securities. § 230.138 Publications or distributions of research reports by brokers or dealers about securities other than those they are distributing. § 230.139 Publications or distributions of research reports by brokers or dealers distributing securities. § 230.139a Publications by brokers or dealers distributing asset-backed securities. § 230.139b Publications or distributions of covered investment fund research reports by brokers or dealers distributing securities. § 230.140 Definition of “distribution” in section 2(11) for certain transactions. § 230.141 Definition of “commission from an underwriter or dealer not in excess of the usual and customary distributors' or sellers' commissions” in section 2(11), for certain transactions. § 230.142 Definition of “participates” and “participation,” as used in section 2(11), in relation to certain transactions. § 230.143 Definition of “has purchased”, “sells for”, “participates”, and “participation”, as used in section 2(11), in relation to certain transactions of foreign governments for war purposes. § 230.144 Persons deemed not to be engaged in a distribution and therefore not underwriters. § 230.144A Private resales of securities to institutions. § 230.145 Reclassification of securities, mergers, consolidations and acquisitions of assets. § 230.145a Business combinations with reporting shell companies. § 230.146 Rules under section 18 of the Act. § 230.147 Intrastate offers and sales. § 230.147A Intrastate sales exemption. § 230.148 Exemption from general solicitation or general advertising. § 230.149 Definition of “exchanged” in section 3(a)(9), for certain transactions. § 230.150 Definition of “commission or other remuneration” in section 3(a)(9), for certain transactions. § 230.151 Safe harbor definition of certain “annuity contracts or optional annuity contracts” within the meaning of section 3(a)(8). § 230.152 Integration. § 230.152a Offer or sale of certain fractional interests. § 230.153 Definition of “preceded by a prospectus” as used in section 5(b)(2) of the Act, in relation to certain transactions. § 230.153a Definition of “preceded by a prospectus” as used in section 5(b)(2) of the Act, in relation to certain transactions requiring approval of security holders. § 230.153b Definition of “preceded by a prospectus”, as used in ...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/cfr/text/17/part-230",
    "jurisdiction": "us_federal",
    "legal_domain": "corporate_regulatory",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal corporate regulations SEC",
      "search_rank": 1,
      "snippet": "The following rules relate solely to the application of Section 5 of the Securities Act of 1933 (the Act) [15 U.S.C. 77e] and not to antifraud or other ..."
    },
    "created_at": "2025-08-01T17:04:24.528141",
    "content_hash": "046130ef4f097f188c05c9f83ed009ab"
  },
  {
    "id": "search_us_federal_statute_1_1754067864",
    "title": "26 CFR § 301.7701-2 - Business entities; definitions.",
    "content": "26 CFR § 301.7701-2 - Business entities; definitions. | Electronic Code of Federal Regulations (e-CFR) | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Electronic Code of Federal Regulations (e-CFR) Title 26—Internal Revenue CHAPTER I—INTERNAL REVENUE SERVICE, DEPARTMENT OF THE TREASURY SUBCHAPTER F—PROCEDURE AND ADMINISTRATION PART 301—PROCEDURE AND ADMINISTRATION Information and Returns § 301.7701-2 Business entities; definitions. 26 CFR § 301.7701-2 - Business entities; definitions. CFR Table of Popular Names prev | next § 301.7701-2 Business entities; definitions. (a) Business entities. For purposes of this section and § 301.7701-3, a business entity is any entity recognized for federal tax purposes (including an entity with a single owner that may be disregarded as an entity separate from its owner under § 301.7701-3) that is not properly classified as a trust under § 301.7701-4 or otherwise subject to special treatment under the Internal Revenue Code. A business entity with two or more members is classified for federal tax purposes as either a corporation or a partnership. A business entity with only one owner is classified as a corporation or is disregarded; if the entity is disregarded, its activities are treated in the same manner as a sole proprietorship, branch, or division of the owner. But see paragraphs (c)(2)(iii) through (vii) of this section for special rules that apply to an eligible entity that is otherwise disregarded as an entity separate from its owner. (b) Corporations. For federal tax purposes, the term corporation means— (1) A business entity organized under a Federal or State statute, or under a statute of a federally recognized Indian tribe, if the statute describes or refers to the entity as incorporated or as a corporation, body corporate, or body politic; (2) An association (as determined under § 301.7701-3); (3) A business entity organized under a State statute, if the statute describes or refers to the entity as a joint-stock company or joint-stock association; (4) An insurance company; (5) A State-chartered business entity conducting banking activities, if any of its deposits are insured under the Federal Deposit Insurance Act, as amended, 12 U.S.C. 1811 et seq., or a similar federal statute; (6) A business entity wholly owned by a State or any political subdivision thereof, or a business entity wholly owned by a foreign government or any other entity described in § 1.892-2T; (7) A business entity that is taxable as a corporation under a provision of the Internal Revenue Code other than section 7701(a)(3); and (8) Certain foreign entities—(i) In general. Except as provided in paragraphs (b)(8)(ii) and (d) of this section, the following business entities formed in the following jurisdictions: American Samoa, Corporation Argentina, Sociedad Anonima Australia, Public Limited Company Austria, Aktiengesellschaft Barbados, Limited Company Belgium, Societe Anonyme Belize, Public Limited Company Bolivia, Sociedad Anonima Brazil, Sociedade Anonima Bulgaria, Aktsionerno Druzhestvo. Canada, Corporation and Company Chile, Sociedad Anonima People's Republic of China, Gufen Youxian Gongsi Republic of China (Taiwan), Ku-fen Yu-hsien Kung-szu Colombia, Sociedad Anonima Costa Rica, Sociedad Anonima Cyprus, Public Limited Company Czech Republic, Akciova Spolecnost Denmark, Aktieselskab Ecuador, Sociedad Anonima or Compania Anonima Egypt, Sharikat Al-Mossahamah El Salvador, Sociedad Anonima Estonia, Aktsiaselts European Economic Area/European Union, Societas Europaea Finland, Julkinen Osakeyhtio/Publikt Aktiebolag France, Societe Anonyme Germany, Aktiengesellschaft Greece, Anonymos Etairia Guam, Corporation Guatemala, Sociedad Anonima Guyana, Public Limited Company Honduras, Sociedad Anonima Hong Kong, Public Limited Company Hungary, Reszvenytarsasag Iceland, Hlutafelag India, Public Limited Company Indonesia, Perseroan Terbuka Ireland, Public Limited Company Israel, Public Limited Company Italy, Societa per Azioni Jamaica, Public Limited Company Japan, Kabushiki Kaisha Kazakstan, Ashyk Aktsionerlik Kogham Republic of Korea, Chusik Hoesa Latvia, Akciju Sabiedriba Liberia, Corporation Liechtenstein, Aktiengesellschaft Lithuania, Akcine Bendroves Luxembourg, Socie...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/cfr/text/26/301.7701-2",
    "jurisdiction": "us_federal",
    "legal_domain": "corporate_regulatory",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal corporate regulations SEC",
      "search_rank": 2,
      "snippet": "A business entity with two or more members is classified for federal tax purposes as either a corporation or a partnership."
    },
    "created_at": "2025-08-01T17:04:24.766310",
    "content_hash": "46c6534c918f3a62b98f56a1ffc45936"
  },
  {
    "id": "search_us_federal_statute_2_1754067864",
    "title": "26 U.S. Code § 368 - Definitions relating to corporate ...",
    "content": "26 U.S. Code § 368 - Definitions relating to corporate reorganizations | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 26 Subtitle A CHAPTER 1 Subchapter C PART III Subpart D § 368 Quick search by citation: Title Section Go! 26 U.S. Code § 368 - Definitions relating to corporate reorganizations U.S. Code Notes prev | next (a) Reorganization (1) In generalFor purposes of parts I and II and this part, the term “reorganization” means— (A) a statutory merger or consolidation; (B) the acquisition by one corporation, in exchange solely for all or a part of its voting stock (or in exchange solely for all or a part of the voting stock of a corporation which is in control of the acquiring corporation), of stock of another corporation if, immediately after the acquisition, the acquiring corporation has control of such other corporation (whether or not such acquiring corporation had control immediately before the acquisition); (C) the acquisition by one corporation, in exchange solely for all or a part of its voting stock (or in exchange solely for all or a part of the voting stock of a corporation which is in control of the acquiring corporation), of substantially all of the properties of another corporation, but in determining whether the exchange is solely for stock the assumption by the acquiring corporation of a liability of the other shall be disregarded; (D) a transfer by a corporation of all or a part of its assets to another corporation if immediately after the transfer the transferor, or one or more of its shareholders (including persons who were shareholders immediately before the transfer), or any combination thereof, is in control of the corporation to which the assets are transferred; but only if, in pursuance of the plan, stock or securities of the corporation to which the assets are transferred are distributed in a transaction which qualifies under section 354, 355, or 356; (E) a recapitalization; (F) a mere change in identity, form, or place of organization of one corporation, however effected; or (G) a transfer by a corporation of all or part of its assets to another corporation in a title 11 or similar case; but only if, in pursuance of the plan, stock or securities of the corporation to which the assets are transferred are distributed in a transaction which qualifies under section 354, 355, or 356. (2) Special rules relating to paragraph (1) (A) Reorganizations described in both paragraph (1)(C) and paragraph (1)(D) If a transaction is described in both paragraph (1)(C) and paragraph (1)(D), then, for purposes of this subchapter (other than for purposes of subparagraph (C)), such transaction shall be treated as described only in paragraph (1)(D). (B) Additional consideration in certain paragraph (1)(C) casesIf— (i) one corporation acquires substantially all of the properties of another corporation, (ii) the acquisition would qualify under paragraph (1)(C) but for the fact that the acquiring corporation exchanges money or other property in addition to voting stock, and (iii) the acquiring corporation acquires, solely for voting stock described in paragraph (1)(C), property of the other corporation having a fair market value which is at least 80 percent of the fair market value of all of the property of the other corporation, then such acquisition shall (subject to subparagraph (A) of this paragraph) be treated as qualifying under paragraph (1)(C). Solely for the purpose of determining whether clause (iii) of the preceding sentence applies, the amount of any liability assumed by the acquiring corporation shall be treated as money paid for the property. (C) Transfers of assets or stock to subsidiaries in certain paragraph (1)(A), (1)(B), (1)(C), and (1)(G) cases A transaction otherwise qualifying under paragraph (1)(A), (1)(B), or (1)(C) shall not be disqualified by reason of the fact that part or all of the assets or stock which were acquired in the transaction are transferred to a corporation controlled by the corporation acquiring such assets or stock. A similar rule shall apply to a transaction otherwise qualifying under paragraph (1)(G) where the requirements of subparagraphs (A) and (B) of section 354(b)(1) are met with respect to the ...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/26/368",
    "jurisdiction": "us_federal",
    "legal_domain": "corporate_regulatory",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal corporate regulations SEC",
      "search_rank": 3,
      "snippet": "A corporation meets the requirements of this clause if not more than 25 percent of the value of its total assets is invested in the stock and securities of any ..."
    },
    "created_at": "2025-08-01T17:04:24.986605",
    "content_hash": "92dbf3f8e0d7108bffa8853636147d59"
  },
  {
    "id": "search_us_federal_statute_3_1754067865",
    "title": "corporations | Wex | US Law | LII / Legal Information Institute",
    "content": "corporations | Wex | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Wex corporations corporationsCorporations are entities that act as a single, fictional person. Much like an actual person, a corporation may sue, be sued, lend, and borrow. Additionally, a company which has been incorporated can easily transfer ownership through stock sales and exist indefinitely.  Corporations are primarily authorized and governed by state law with many states following the Model Business Corporation Act provided by the ABA. These state corporation laws typically require articles of incorporation to document the corporation's creation and to provide provisions regarding the management of internal affairs. Most state corporation statutes also operate under the assumption that each corporation will adopt bylaws to define the rights and obligations of officers, persons, and groups within its structure. While primarily governed by state law, certain aspects of corporations are governed by federal law. In particular, the Securities Act of 1933 requires most corporations offering stock to file with the Securities Exchange Commission (SEC) and regularly disclose financial statements / other executive information. One of the primary benefits of incorporating is limited personal liability. Generally, the only personal assets a shareholder of a corporation can lose in a lawsuit or to pay off corporate debts is their investment in that corporation. In cases of extreme misconduct, however, a lawsuit may necessitate targeting individual shareholder’s assets through what is known as piercing the corporate veil. The exact requirements necessary to pierce the corporate veil vary from state to state. The primary downside of a traditional corporation is its lack of pass-through tax status. Pass-through tax status allows an entity to avoid paying taxes on its income and instead pass that income to its owners, who then pay taxes individually. Because of this lack of pass-through tax status, corporate income is subject to double-taxation.For example, if a corporation with 10 shareholders records a profit of $100,000 and the universal tax rate is 10%, only $90,000 will be given to shareholders for a $9000/shareholder profit.This $9000 profit will again be taxed at the individual level and each shareholder will walk away with $8,100.This double-taxation problem led to the creation of S-corporations. Corporate law has important intersections with contracts and commercial transactions law.[Last reviewed in July of 2022 by the Wex Definitions Team]WexCOMMERCE wex articles business law business organizations corporations Wex Toolbox Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/wex/corporations",
    "jurisdiction": "us_federal",
    "legal_domain": "corporate_regulatory",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal corporate regulations SEC",
      "search_rank": 4,
      "snippet": "In particular, the Securities Act of 1933 requires most corporations offering stock to file with the Securities Exchange Commission (SEC) and regularly disclose ..."
    },
    "created_at": "2025-08-01T17:04:25.166213",
    "content_hash": "0c6f705042396d515d5b41a8f6310ffa"
  },
  {
    "id": "search_us_federal_statute_4_1754067865",
    "title": "15 U.S. Code § 78o - Registration and regulation of brokers ...",
    "content": "15 U.S. Code § 78o - Registration and regulation of brokers and dealers | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 15 CHAPTER 2B § 78o Quick search by citation: Title Section Go! 15 U.S. Code § 78o - Registration and regulation of brokers and dealers U.S. Code Notes Authorities (CFR) prev | next (a) Registration of all persons utilizing exchange facilities to effect transactions; exemptions (1) It shall be unlawful for any broker or dealer which is either a person other than a natural person or a natural person not associated with a broker or dealer which is a person other than a natural person (other than such a broker or dealer whose business is exclusively intrastate and who does not make use of any facility of a national securities exchange) to make use of the mails or any means or instrumentality of interstate commerce to effect any transactions in, or to induce or attempt to induce the purchase or sale of, any security (other than an exempted security or commercial paper, bankers’ acceptances, or commercial bills) unless such broker or dealer is registered in accordance with subsection (b) of this section. (2) The Commission, by rule or order, as it deems consistent with the public interest and the protection of investors, may conditionally or unconditionally exempt from paragraph (1) of this subsection any broker or dealer or class of brokers or dealers specified in such rule or order. (b) Manner of registration of brokers and dealers (1) A broker or dealer may be registered by filing with the Commission an application for registration in such form and containing such information and documents concerning such broker or dealer and any persons associated with such broker or dealer as the Commission, by rule, may prescribe as necessary or appropriate in the public interest or for the protection of investors. Within forty-five days of the date of the filing of such application (or within such longer period as to which the applicant consents), the Commission shall— (A) by order grant registration, or (B) institute proceedings to determine whether registration should be denied. Such proceedings shall include notice of the grounds for denial under consideration and opportunity for hearing and shall be concluded within one hundred twenty days of the date of the filing of the application for registration. At the conclusion of such proceedings, the Commission, by order, shall grant or deny such registration. The Commission may extend the time for conclusion of such proceedings for up to ninety days if it finds good cause for such extension and publishes its reasons for so finding or for such longer period as to which the applicant consents. The Commission shall grant such registration if the Commission finds that the requirements of this section are satisfied. The order granting registration shall not be effective until such broker or dealer has become a member of a registered securities association, or until such broker or dealer has become a member of a national securities exchange, if such broker or dealer effects transactions solely on that exchange, unless the Commission has exempted such broker or dealer, by rule or order, from such membership. The Commission shall deny such registration if it does not make such a finding or if it finds that if the applicant were so registered, its registration would be subject to suspension or revocation under paragraph (4) of this subsection. (2) (A) An application for registration of a broker or dealer to be formed or organized may be made by a broker or dealer to which the broker or dealer to be formed or organized is to be the successor. Such application, in such form as the Commission, by rule, may prescribe, shall contain such information and documents concerning the applicant, the successor, and any persons associated with the applicant or the successor, as the Commission, by rule, may prescribe as necessary or appropriate in the public interest or for the protection of investors. The grant or denial of registration to such an applicant shall be in accordance with the procedures set forth in paragraph (1) of this subsection. If the Commission grants such registration, the registration shall termina...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/15/78o",
    "jurisdiction": "us_federal",
    "legal_domain": "corporate_regulatory",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal corporate regulations SEC",
      "search_rank": 5,
      "snippet": "A broker or dealer may be registered by filing with the Commission an application for registration in such form and containing such information and documents."
    },
    "created_at": "2025-08-01T17:04:25.621152",
    "content_hash": "4b53518a04b9c2e1124ad601e6451aa2"
  },
  {
    "id": "search_us_federal_statute_0_1754067866",
    "title": "Federal Rules of Civil Procedure - Law.Cornell.Edu",
    "content": "Federal Rules of Civil Procedure | Federal Rules of Civil Procedure | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Federal Rules of Civil Procedure Federal Rules of Civil Procedure These are the Federal Rules of Civil Procedure, as amended to December 1, 2024 1 .  Click on any rule to read it. RULES OF CIVIL PROCEDURE FOR THE UNITED STATES DISTRICT COURTS TITLE I. SCOPE OF RULES; FORM OF ACTION Rule 1 . Scope and Purpose Rule 2 . One Form of Action TITLE II. COMMENCING AN ACTION; SERVICE OF PROCESS, PLEADINGS, MOTIONS, AND ORDERS Rule 3 . Commencing an Action Rule 4 . Summons Rule 4.1 . Serving Other Process Rule 5 . Serving and Filing Pleadings and Other Papers Rule 5.1 . Constitutional Challenge to a Statute—Notice, Certification, and Intervention Rule 5.2 . Privacy Protection For Filings Made with the Court Rule 6 . Computing and Extending Time; Time for Motion Papers TITLE III. PLEADINGS AND MOTIONS Rule 7 . Pleadings Allowed; Form of Motions and Other Papers Rule 7.1 . Disclosure Statement Rule 8 . General Rules of Pleading Rule 9 . Pleading Special Matters Rule 10 . Form of Pleadings Rule 11 . Signing Pleadings, Motions, and Other Papers; Representations to the Court; Sanctions Rule 12 . Defenses and Objections: When and How Presented; Motion for Judgment on the Pleadings; Consolidating Motions; Waiving Defenses; Pretrial Hearing Rule 13 . Counterclaim and Crossclaim Rule 14 . Third-Party Practice Rule 15 . Amended and Supplemental Pleadings Rule 16 . Pretrial Conferences; Scheduling; Management TITLE IV. PARTIES Rule 17 . Plaintiff and Defendant; Capacity; Public Officers Rule 18 . Joinder of Claims Rule 19 . Required Joinder of Parties Rule 20 . Permissive Joinder of Parties Rule 21 . Misjoinder and Nonjoinder of Parties Rule 22 . Interpleader Rule 23 . Class Actions Rule 23.1 . Derivative Actions Rule 23.2 . Actions Relating to Unincorporated Associations Rule 24 . Intervention Rule 25 . Substitution of Parties TITLE V. DISCLOSURES AND DISCOVERY Rule 26 . Duty to Disclose; General Provisions Governing Discovery Rule 27 . Depositions to Perpetuate Testimony Rule 28 . Persons Before Whom Depositions May Be Taken Rule 29 . Stipulations About Discovery Procedure Rule 30 . Depositions by Oral Examination Rule 31 . Depositions by Written Questions Rule 32 . Using Depositions in Court Proceedings Rule 33 . Interrogatories to Parties Rule 34 . Producing Documents, Electronically Stored Information, and Tangible Things, or Entering onto Land, for Inspection and Other Purposes Rule 35 . Physical and Mental Examinations Rule 36 . Requests for Admission Rule 37 . Failure to Make Disclosures or to Cooperate in Discovery; Sanctions TITLE VI. TRIALS Rule 38 . Right to a Jury Trial; Demand Rule 39 . Trial by Jury or by the Court Rule 40 . Scheduling Cases for Trial Rule 41 . Dismissal of Actions Rule 42 . Consolidation; Separate Trials Rule 43 . Taking Testimony Rule 44 . Proving an Official Record Rule 44.1 . Determining Foreign Law Rule 45 . Subpoena Rule 46 . Objecting to a Ruling or Order Rule 47 . Selecting Jurors Rule 48 . Number of Jurors; Verdict; Polling Rule 49 . Special Verdict; General Verdict and Questions Rule 50 . Judgment as a Matter of Law in a Jury Trial; Related Motion for a New Trial; Conditional Ruling Rule 51 . Instructions to the Jury; Objections; Preserving a Claim of Error Rule 52 . Findings and Conclusions by the Court; Judgment on Partial Findings Rule 53 . Masters TITLE VII. JUDGMENT Rule 54 . Judgment; Costs Rule 55 . Default; Default Judgment Rule 56 . Summary Judgment Rule 57 . Declaratory Judgment Rule 58 . Entering Judgment Rule 59 . New Trial; Altering or Amending a Judgment Rule 60 . Relief from a Judgment or Order Rule 61 . Harmless Error Rule 62 . Stay of Proceedings to Enforce a Judgment Rule 62.1 . Indicative Ruling on a Motion for Relief That is Barred by a Pending Appeal Rule 63 . Judge's Inability to Proceed TITLE VIII. PROVISIONAL AND FINAL REMEDIES Rule 64 . Seizing a Person or Property Rule 65 . Injunctions and Restraining Orders Rule 65.1 . Proceedings Against a Security Provider Rule 66 . Receivers Rule 67 . Deposit into Court Rule 68 . Offer of Judgment Rule 69 . Execution Rule 70 . Enforcing a Judgment for a Specific Act Rule 71 . E...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/rules/frcp",
    "jurisdiction": "us_federal",
    "legal_domain": "civil_criminal_procedure",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal civil procedure rules",
      "search_rank": 1,
      "snippet": "These are the"
    },
    "created_at": "2025-08-01T17:04:26.925069",
    "content_hash": "2b82dad5e96e9dae032ca0cf9ed2622f"
  },
  {
    "id": "search_us_federal_statute_1_1754067867",
    "title": "Rule 56. Summary Judgment | Federal Rules of Civil Procedure",
    "content": "Rule 56. Summary Judgment | Federal Rules of Civil Procedure | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Federal Rules of Civil Procedure Rule 56. Summary Judgment Rule 56. Summary Judgment (a) Motion for Summary Judgment or Partial Summary Judgment. A party may move for summary judgment, identifying each claim or defense — or the part of each claim or defense — on which summary judgment is sought. The court shall grant summary judgment if the movant shows that there is no genuine dispute as to any material fact and the movant is entitled to judgment as a matter of law. The court should state on the record the reasons for granting or denying the motion. (b) Time to File a Motion. Unless a different time is set by local rule or the court orders otherwise, a party may file a motion for summary judgment at any time until 30 days after the close of all discovery. (c) Procedures. (1) Supporting Factual Positions. A party asserting that a fact cannot be or is genuinely disputed must support the assertion by: (A) citing to particular parts of materials in the record, including depositions, documents, electronically stored information, affidavits or declarations, stipulations (including those made for purposes of the motion only), admissions, interrogatory answers, or other materials; or (B) showing that the materials cited do not establish the absence or presence of a genuine dispute, or that an adverse party cannot produce admissible evidence to support the fact. (2) Objection That a Fact Is Not Supported by Admissible Evidence. A party may object that the material cited to support or dispute a fact cannot be presented in a form that would be admissible in evidence. (3) Materials Not Cited. The court need consider only the cited materials, but it may consider other materials in the record. (4) Affidavits or Declarations. An affidavit or declaration used to support or oppose a motion must be made on personal knowledge, set out facts that would be admissible in evidence, and show that the affiant or declarant is competent to testify on the matters stated. (d) When Facts Are Unavailable to the Nonmovant. If a nonmovant shows by affidavit or declaration that, for specified reasons, it cannot present facts essential to justify its opposition, the court may: (1) defer considering the motion or deny it; (2) allow time to obtain affidavits or declarations or to take discovery; or (3) issue any other appropriate order. (e) Failing to Properly Support or Address a Fact. If a party fails to properly support an assertion of fact or fails to properly address another party’s assertion of fact as required by Rule 56(c) , the court may: (1) give an opportunity to properly support or address the fact; (2) consider the fact undisputed for purposes of the motion; (3) grant summary judgment if the motion and supporting materials — including the facts considered undisputed — show that the movant is entitled to it; or (4) issue any other appropriate order. (f) Judgment Independent of the Motion. After giving notice and a reasonable time to respond, the court may: (1) grant summary judgment for a nonmovant; (2) grant the motion on grounds not raised by a party;or (3) consider summary judgment on its own after identifying for the parties material facts that may not be genuinely in dispute. (g) Failing to Grant All the Requested Relief. If the court does not grant all the relief requested by the motion, it may enter an order stating any material fact — including an item of damages or other relief — that is not genuinely in dispute and treating the fact as established in the case. (h) Affidavit or Declaration Submitted in Bad Faith. If satisfied that an affidavit or declaration under this rule is submitted in bad faith or solely for delay, the court — after notice and a reasonable time to respond — may order the submitting party to pay the other party the reasonable expenses, including attorney’s fees, it incurred as a result. An offending party or attorney may also be held in contempt or subjected to other appropriate sanctions. (As amended Dec. 27, 1946, eff. Mar. 19, 1948; Jan. 21, 1963, eff. July 1, 1963; Mar. 2, 1987, eff. Aug. 1, 1987; Apr. 30, 2007, eff. Dec. 1, 2007; Mar. 26, 2009, eff. Dec. 1,...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/rules/frcp/rule_56",
    "jurisdiction": "us_federal",
    "legal_domain": "civil_criminal_procedure",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal civil procedure rules",
      "search_rank": 2,
      "snippet": "The court shall grant summary judgment if the movant shows that there is no genuine dispute as to any material fact and the movant is entitled to judgment as a ..."
    },
    "created_at": "2025-08-01T17:04:27.125595",
    "content_hash": "2ebd0eaee6a72730872abab02be27c54"
  },
  {
    "id": "search_us_federal_statute_2_1754067867",
    "title": "Rule 8. General Rules of Pleading - Law.Cornell.Edu",
    "content": "Rule 8. General Rules of Pleading | Federal Rules of Civil Procedure | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Federal Rules of Civil Procedure Rule 8. General Rules of Pleading Rule 8. General Rules of Pleading (a) Claim for Relief. A pleading that states a claim for relief must contain: (1) a short and plain statement of the grounds for the court's jurisdiction, unless the court already has jurisdiction and the claim needs no new jurisdictional support; (2) a short and plain statement of the claim showing that the pleader is entitled to relief; and (3) a demand for the relief sought, which may include relief in the alternative or different types of relief. (b) Defenses; Admissions and Denials. (1) In General. In responding to a pleading, a party must: (A) state in short and plain terms its defenses to each claim asserted against it; and (B) admit or deny the allegations asserted against it by an opposing party. (2) Denials—Responding to the Substance. A denial must fairly respond to the substance of the allegation. (3) General and Specific Denials. A party that intends in good faith to deny all the allegations of a pleading—including the jurisdictional grounds—may do so by a general denial. A party that does not intend to deny all the allegations must either specifically deny designated allegations or generally deny all except those specifically admitted. (4) Denying Part of an Allegation. A party that intends in good faith to deny only part of an allegation must admit the part that is true and deny the rest. (5) Lacking Knowledge or Information. A party that lacks knowledge or information sufficient to form a belief about the truth of an allegation must so state, and the statement has the effect of a denial. (6) Effect of Failing to Deny. An allegation—other than one relating to the amount of damages—is admitted if a responsive pleading is required and the allegation is not denied. If a responsive pleading is not required, an allegation is considered denied or avoided. (c) Affirmative Defenses. (1) In General. In responding to a pleading, a party must affirmatively state any avoidance or affirmative defense, including: • accord and satisfaction; • arbitration and award; • assumption of risk; • contributory negligence; • duress; • estoppel; • failure of consideration; • fraud; • illegality; • injury by fellow servant; • laches; • license; • payment; • release; • res judicata; • statute of frauds; • statute of limitations; and • waiver. (2) Mistaken Designation. If a party mistakenly designates a defense as a counterclaim, or a counterclaim as a defense, the court must, if justice requires, treat the pleading as though it were correctly designated, and may impose terms for doing so. (d) Pleading to Be Concise and Direct; Alternative Statements; Inconsistency. (1) In General. Each allegation must be simple, concise, and direct. No technical form is required. (2) Alternative Statements of a Claim or Defense. A party may set out 2 or more statements of a claim or defense alternatively or hypothetically, either in a single count or defense or in separate ones. If a party makes alternative statements, the pleading is sufficient if any one of them is sufficient. (3) Inconsistent Claims or Defenses. A party may state as many separate claims or defenses as it has, regardless of consistency. (e) Construing Pleadings. Pleadings must be construed so as to do justice. Notes (As amended Feb. 28, 1966, eff. July 1, 1966; Mar. 2, 1987, eff. Aug. 1, 1987; Apr. 30, 2007, eff. Dec. 1, 2007; Apr. 28, 2010, eff. Dec. 1, 2010.) Notes of Advisory Committee on Rules—1937 Note to Subdivision (a) . See [former] Equity Rules 25 (Bill of Complaint—Contents), and 30 (Answer—Contents—Counterclaim). Compare 2 Ind.Stat.Ann. (Burns, 1933) §§2–1004, 2–1015; 2 Ohio Gen.Code Ann. (Page, 1926) §§11305, 11314; Utah Rev.Stat.Ann. (1933), §§104–7–2, 104–9–1. See Rule 19(c) for the requirement of a statement in a claim for relief of the names of persons who ought to be parties and the reason for their omission. See Rule 23(b) for particular requirements as to the complaint in a secondary action by shareholders. Note to Subdivision (b) . 1. This rule supersedes the methods of pleading prescribed in U.S.C., T...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/rules/frcp/rule_8",
    "jurisdiction": "us_federal",
    "legal_domain": "civil_criminal_procedure",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal civil procedure rules",
      "search_rank": 3,
      "snippet": "A pleading that states a claim for relief must contain: (1) a short and plain statement of the grounds for the court's jurisdiction."
    },
    "created_at": "2025-08-01T17:04:27.297263",
    "content_hash": "476d3a4809de2d9ab70aed4fe2c2bae6"
  },
  {
    "id": "search_us_federal_statute_3_1754067867",
    "title": "Federal Rules of Civil Procedure | Wex - Law.Cornell.Edu",
    "content": "Federal Rules of Civil Procedure | Wex | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Wex Federal Rules of Civil Procedure Federal Rules of Civil ProcedureThe Federal Rules of Civil Procedure are a body of 86 rules that govern procedural law, in contrast to substantive law, for civil proceedings in U.S. federal courts. Find the full text here. Their scope and purpose, as laid out in Rule 1, is to “govern the procedure in all civil actions and proceedings in the United States district courts,” and instructs that they should be construed to “secure the just, speedy, and inexpensive determination of every action and proceeding.” More specifically, the rules govern the procedure of, among others: pleading requirements, motions to dismiss, amendments, joinder, class actions, discovery, trials, injunctive relief, and the issuance of judgments and orders. The Rules do not govern civil procedure in state court,  criminal procedure (see Federal Rules of Criminal Procedure), evidentiary rules (see Federal Rules of Evidence), or appeals (see Federal Rules of Appellate Procedure). History: Federal courts did not always have a uniform set of rules to govern civil procedure. In the founding days of the republic, rules of procedure centered around the common law distinction between actions in courts of equity and courts of law. For actions in courts of law, Chapter XXI, Section 2 of the Judiciary Act of 1789 provided that the procedural rules for such actions in federal court “shall be the same in each state respectively as are now used or allowed in the supreme courts of the same.” That is, the 1789 Act established no uniform procedural rules for actions at law, but rather required federal courts to adopt the procedural rules of the state in which they were located. Furthermore, the language “as are now used” required federal courts to adopt procedural rules as they existed in 1789. So, for example, ten years after the 1789 Act, the state procedural laws of 1789 would still govern procedural law in federal courts in that state, even if the state procedural laws changed since the 1789 Act. For states admitted into the union after 1789, Chapter LXVIII, Section 1 of the 1828 Act provided that federal courts adopt the state procedural rules as they existed at the time of admittance to the union. This principle of requiring federal courts to adopt and conform to state procedural rules as they existed at the time of adoption is known as statis conformity. In 1872, Congress passed a new Conformity Act that provided for dynamic conformity for actions at law, meaning that federal courts followed the contemporary state procedural laws. Contrarily, Congress provided for uniform rules for actions in equity in federal courts. In the Process Act of 1792, Congress delegated to the Supreme Court the power to regulate procedural rules for cases in equity and admiralty. Section 2 provides that, in cases of equity and admiralty, federal courts are subject “to [procedural] regulations as the supreme court of the United States shall think proper from time to time by rule to prescribe to any circuit or district court concerning the same.” In summary, Congress delegated the power to create procedural rules for federal cases in equity or admiralty to the U.S. Supreme Court. In contrast, for federal cases at law, Congress at first required federal courts to follow state procedural rules, as they existed in 1789 or at the time of admittance to the union, but in 1872 required federal courts to follow state procedural laws as they currently then existed. Reform: In the early 20th century, legal commentators and jurists, with the American Bar Association (ABA) leading the way, began to push for uniformity of federal procedure in cases at law. One main grievance about the system established by the Act of 1789 and its progeny was that under it, federal courts often followed the states’ rigid, statutory systems of pleading. In 1915, the American Bar Association Committee on Uniform Judicial Procedure released a report lamenting that, under the current system, “the judge is often helpless to prevent injustice being done in his very presence,” and the lawyer “is compelled to take advantage of technicalities.” The report ...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/wex/federal_rules_of_civil_procedure",
    "jurisdiction": "us_federal",
    "legal_domain": "civil_criminal_procedure",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal civil procedure rules",
      "search_rank": 4,
      "snippet": "The"
    },
    "created_at": "2025-08-01T17:04:27.592932",
    "content_hash": "2eee95646208c028de6ddf336cc769f4"
  },
  {
    "id": "search_us_federal_statute_4_1754067867",
    "title": "Rule 5. Serving and Filing Pleadings and Other Papers",
    "content": "Rule 5. Serving and Filing Pleadings and Other Papers | Federal Rules of Civil Procedure | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Federal Rules of Civil Procedure Rule 5. Serving and Filing Pleadings and Other Papers Rule 5. Serving and Filing Pleadings and Other Papers (a) Service: When Required. (1) In General. Unless these rules provide otherwise, each of the following papers must be served on every party: (A) an order stating that service is required; (B) a pleading filed after the original complaint, unless the court orders otherwise under Rule 5(c) because there are numerous defendants; (C) a discovery paper required to be served on a party, unless the court orders otherwise; (D) a written motion, except one that may be heard ex parte; and (E) a written notice, appearance, demand, or offer of judgment, or any similar paper. (2) If a Party Fails to Appear. No service is required on a party who is in default for failing to appear. But a pleading that asserts a new claim for relief against such a party must be served on that party under Rule 4 . (3) Seizing Property. If an action is begun by seizing property and no person is or need be named as a defendant, any service required before the filing of an appearance, answer, or claim must be made on the person who had custody or possession of the property when it was seized. (b) Service: How Made. (1) Serving an Attorney. If a party is represented by an attorney, service under this rule must be made on the attorney unless the court orders service on the party. (2) Service in General. A paper is served under this rule by: (A) handing it to the person; (B) leaving it: (i) at the person's office with a clerk or other person in charge or, if no one is in charge, in a conspicuous place in the office; or (ii) if the person has no office or the office is closed, at the person's dwelling or usual place of abode with someone of suitable age and discretion who resides there; (C) mailing it to the person's last known address—in which event service is complete upon mailing; (D) leaving it with the court clerk if the person has no known address; (E) sending it to a registered user by filing it with the court's electronic-filing system or sending it by other electronic means that the person consented to in writing—in either of which events service is complete upon filing or sending, but is not effective if the filer or sender learns that it did not reach the person to be served; or (F) delivering it by any other means that the person consented to in writing—in which event service is complete when the person making service delivers it to the agency designated to make delivery. (3) Using Court Facilities. [Abrogated (Apr._, 2018, eff. Dec. 1, 2018)] (c) Serving Numerous Defendants. (1) In General. If an action involves an unusually large number of defendants, the court may, on motion or on its own, order that: (A) defendants’ pleadings and replies to them need not be served on other defendants; (B) any crossclaim, counterclaim, avoidance, or affirmative defense in those pleadings and replies to them will be treated as denied or avoided by all other parties; and (C) filing any such pleading and serving it on the plaintiff constitutes notice of the pleading to all parties. (2) Notifying Parties. A copy of every such order must be served on the parties as the court directs. (d) Filing. (1) Required Filings; Certificate of Service. (A) Papers after the Complaint. Any paper after the complaint that is required to be served—must be filed no later than a reasonable time after service. But disclosures under Rule 26(a)(1) or (2) and the following discovery requests and responses must not be filed until they are used in the proceeding or the court orders filing: depositions, interrogatories, requests for documents or tangible things or to permit entry onto land, and requests for admission. (B) Certificate of Service . No certificate of service is required when a paper is served by filing it with the court's electronic-filing system. When a paper that is required to be served is served by other means: (i) if the paper is filed, a certificate of service must be filed with it or within a reasonable time after service; and (ii) if the paper is not ...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/rules/frcp/rule_5",
    "jurisdiction": "us_federal",
    "legal_domain": "civil_criminal_procedure",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal civil procedure rules",
      "search_rank": 5,
      "snippet": "A person represented by an attorney"
    },
    "created_at": "2025-08-01T17:04:27.805187",
    "content_hash": "bbdecd552d6a9b86680afc04c6be34f8"
  },
  {
    "id": "search_us_federal_statute_0_1754067869",
    "title": "constitutional amendment | Wex - Law.Cornell.Edu",
    "content": "constitutional amendment | Wex | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Wex constitutional amendment constitutional amendmentAn amendment is a formal revision or addition to the US Constitution. As per Article V of the Constitution, there are several methods to propose an amendment. Once an amendment is proposed, it requires the approval of ¾ of the states to be ratified. Traditionally, states are free to ratify proposed amendments at their leisure for an indefinite period of time. For example, the 27th Amendment was not ratified by the necessary number of states until over 200 years after it was proposed. Modern amendment proposals tend to include a 7-year time frame for states to ratify an amendment. For this reason, the Equal Rights Amendment has not become law despite achieving ratification by ¾ of the states. Currently, there are 27 amendments to the United States Constitution. The first 10 amendments are known as the Bill of Rights. [Last reviewed in August of 2022 by the Wex Definitions Team]WexCIVICS local governmental law the Constitution wex definitions constitutional law government legal education and practice Wex Toolbox Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/wex/constitutional_amendment",
    "jurisdiction": "us_federal",
    "legal_domain": "constitutional_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu constitutional amendments",
      "search_rank": 1,
      "snippet": "An amendment is a formal revision or addition to the US Constitution. As per Article V of the Constitution, there are several methods to propose an amendment. ..."
    },
    "created_at": "2025-08-01T17:04:29.056508",
    "content_hash": "c4a6b560b2a22b23d32f9b00bc68aff2"
  },
  {
    "id": "search_us_federal_statute_1_1754067869",
    "title": "U.S. Constitution Annotated: Table Of Contents",
    "content": "U.S. Constitution Annotated: Table Of Contents | U.S. Constitution Annotated | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Constitution Annotated U.S. Constitution Annotated: Table Of Contents This edition of the Congressional Research Service's U.S. Constitution Annotated is a hypertext interpretation of the CRS text, updated to the currently published version. It links to Supreme Court opinions, the U.S. Code, and the Code of Federal Regulations, as well as enhancing navigation through search, breadcrumbs, linked footnotes, and tables of contents. Preamble Articles Article I - The Legislative Branch Article II - The Executive Branch Article III - The Judicial Branch Article IV - The States Article V - Amendment Article VI - Debts, Supremacy, Oaths Article VII - Ratification Amendments Amendment 1 - Freedom of Religion, Press, Expression Amendment 2 - Right to Bear Arms Amendment 3 - Quartering of Soldiers Amendment 4 - Search and Seizure Amendment 5 - Trial and Punishment, Compensation for Takings Amendment 6 - Right to Speedy Trial, Confrontation of Witnesses Amendment 7 - Trial by Jury in Civil Cases Amendment 8 - Cruel and Unusual Punishment Amendment 9 - Construction of Constitution Amendment 10 - Powers of the States and People Amendment 11 - Judicial Limits Amendment 12 - Choosing the President, Vice Amendment 13 - Slavery Abolished Amendment 14 - Citizenship Rights Amendment 15 - Race No Bar to Vote Amendment 16 - Status of Income Tax Clarified Amendment 17 - Senators Elected by Popular Vote Amendment 18 - Liquor Abolished Amendment 19 - Women's Suffrage Amendment 20 - Presidential, Congressional Terms Amendment 21 - Amendment 18 Repealed Amendment 22 - Presidential Term Limits Amendment 23 - Presidential Vote for District of Columbia Amendment 24 - Poll Tax Barred Amendment 25 - Presidential Disability and Succession Amendment 26 - Voting Age Set to 18 Years Amendment 27 - Limiting Congressional Pay Increases U.S. Constitution Annotated Toolbox Explanation of the Constitution - from the Congressional Research Service Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/constitution-conan",
    "jurisdiction": "us_federal",
    "legal_domain": "constitutional_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu constitutional amendments",
      "search_rank": 2,
      "snippet": "Amendments · Amendment 1 - Freedom of Religion, Press, Expression · Amendment 2 - Right to Bear Arms · Amendment 3 - Quartering of Soldiers · Amendment 4 - Search ..."
    },
    "created_at": "2025-08-01T17:04:29.227637",
    "content_hash": "6b69a95fcdf61d2c8d4c6c68c9070acf"
  },
  {
    "id": "search_us_federal_statute_2_1754067869",
    "title": "Bill of Rights | U.S. Constitution - Law.Cornell.Edu",
    "content": "Bill of Rights | U.S. Constitution | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Constitution Bill of Rights Bill of Rights Primary tabs First Amendment [Religion, Speech, Press, Assembly, Petition (1791)] (see explanation) Second Amendment [Right to Bear Arms (1791)] (see explanation) Third Amendment [Quartering of Troops (1791)] (see explanation) Fourth Amendment [Search and Seizure (1791)] (see explanation) Fifth Amendment [Grand Jury, Double Jeopardy, Self-Incrimination, Due Process (1791)] (see explanation) Sixth Amendment [Criminal Prosecutions - Jury Trial, Right to Confront and to Counsel (1791)] (see explanation) Seventh Amendment [Common Law Suits - Jury Trial (1791)] (see explanation) Eighth Amendment [Excess Bail or Fines, Cruel and Unusual Punishment (1791)] (see explanation) Ninth Amendment [Non-Enumerated Rights (1791)] (see explanation) Tenth Amendment [Rights Reserved to States or People (1791)] (see explanation) ‹ Signers up First Amendment › U.S. Constitution Toolbox Explanation of the Constitution - from the Congressional Research Service Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/constitution/billofrights",
    "jurisdiction": "us_federal",
    "legal_domain": "constitutional_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu constitutional amendments",
      "search_rank": 3,
      "snippet": "First Amendment [Religion, Speech, Press, Assembly, Petition (1791)] (see explanation) ; Second Amendment [Right to Bear Arms (1791)] (see explanation) ; Third ..."
    },
    "created_at": "2025-08-01T17:04:29.392277",
    "content_hash": "2d1f4ef7c29eb45c0a8ab7e78643ca52"
  },
  {
    "id": "search_us_federal_statute_3_1754067869",
    "title": "Role of the President in Proposing an Amendment",
    "content": "Role of the President in Proposing an Amendment | U.S. Constitution Annotated | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Constitution Annotated Article V. Amending the Constitution Proposals Role of the President in Proposing an Amendment prev | next ArtV.3.4 Role of the President in Proposing an Amendment Article V: The Congress, whenever two thirds of both Houses shall deem it necessary, shall propose Amendments to this Constitution, or, on the Application of the Legislatures of two thirds of the several States, shall call a Convention for proposing Amendments, which, in either Case, shall be valid to all Intents and Purposes, as Part of this Constitution, when ratified by the Legislatures of three fourths of the several States, or by Conventions in three fourths thereof, as the one or the other Mode of Ratification may be proposed by the Congress; Provided that no Amendment which may be made prior to the Year One thousand eight hundred and eight shall in any Manner affect the first and fourth Clauses in the Ninth Section of the first Article; and that no State, without its Consent, shall be deprived of its equal Suffrage in the Senate. The Constitution does not specifically establish a role for the President in amending the Constitution.1 FootnoteSee U.S. Const. art. V. This essay does not examine whether the President has any role in an Article V convention of the states. Nonetheless, some Presidents have played a ministerial role in transmitting Congress’s proposed amendments to the states for potential ratification. For example, President George Washington sent the first twelve proposed amendments, including the ten proposals that later became the Bill of Rights, to the states for ratification after Congress approved them.2 FootnoteLetter from President George Washington to Governor Charles Pinckney (Oct. 2, 1789), https://digital.scetv.org/teachingAmerhistory/lessons/GWashingtonLetter.htm. Under modern federal law, the Archivist of the United States is responsible for certifying a state’s ratification of a constitutional amendment. See National Archives and Records Administration Act of 1984, 98 Stat. 2291 (codified at 1 U.S.C. § 106b). In addition, President Abraham Lincoln signed the joint resolution proposing the Thirteenth Amendment abolishing slavery even though his signature was not necessary for proposal or ratification of the amendment.3 FootnoteThe House Joint Resolution Proposing the Thirteenth Amendment to the Constitution, 38th Cong. (1865), https://www.archives.gov/milestone-documents/13th-amendment. Despite these examples of Presidents playing an informal, ministerial role in the amendment process, the Supreme Court has articulated the Judicial Branch’s understanding that the President has no formal constitutional role in that process. In a brief opinion in the 1798 case Hollingsworth v. Virginia, the Court held that the Eleventh Amendment had been “constitutionally adopted.” 4 Footnote3 U.S. (3 Dall.) 378, 382 (1798). The Supreme Court reporter recorded Justice Samuel Chase’s statement during oral argument that the President “has nothing to do with the proposition, or adoption, of amendments to the Constitution.” 5 FootnoteId. at 381 n.2. See also Seth Barrett Tillman, A Textualist Defense of Article I, Section 7, Clause 3: Why Hollingsworth v. Virginia Was Rightly Decided, and Why INS v. Chadha Was Wrongly Reasoned, 83 Tex. L. Rev. 1265, 1275 (2005) (recounting how the Supreme Court reporter recorded Justice Chase’s statement during oral argument). Later, in the 1920 case Hawke v. Smith, the Supreme Court characterized the Court’s decision in Hollingsworth as having “settled” that “submission of a constitutional amendment did not require the action of the President.” 6 FootnoteHawke v. Smith, 253 U.S. 221, 229 (1920). President Jimmy Carter signed a joint resolution purporting to extend the deadline for ratification of the Equal Rights Amendment despite being advised that his signature was unnecessary. Ratification of the Equal Rts. Amend., 44 Op. O.L.C. 1, 8–9 (2020). Therefore, the Court appears to have adopted the view that the President cannot veto a proposed amendment. Footnotes 1 See U.S. Const. art. V. This essay does not examine wheth...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/constitution-conan/article-5/role-of-the-president-in-proposing-an-amendment",
    "jurisdiction": "us_federal",
    "legal_domain": "constitutional_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu constitutional amendments",
      "search_rank": 4,
      "snippet": "Some Presidents have played a ministerial role in transmitting Congress's proposed amendments to the states for potential ratification."
    },
    "created_at": "2025-08-01T17:04:29.598968",
    "content_hash": "851f5457d3a7f4a87ae2e9e54c4d844f"
  },
  {
    "id": "search_us_federal_statute_4_1754067869",
    "title": "14th Amendment | U.S. Constitution - Law.Cornell.Edu",
    "content": "14th Amendment | U.S. Constitution | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Constitution 14th Amendment 14th Amendment The Fourteenth Amendment addresses many aspects of citizenship and the rights of citizens. The most commonly used -- and frequently litigated -- phrase in the amendment is \"equal protection of the laws\", which figures prominently in a wide variety of landmark cases, including Brown v. Board of Education (racial discrimination), Roe v. Wade (reproductive rights), Bush v. Gore (election recounts), Reed v. Reed (gender discrimination), and University of California v. Bakke (racial quotas in education). See more... Primary tabs Amendment XIVSection 1.All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside. No state shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any state deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.Section 2.Representatives shall be apportioned among the several states according to their respective numbers, counting the whole number of persons in each state, excluding Indians not taxed. But when the right to vote at any election for the choice of electors for President and Vice President of the United States, Representatives in Congress, the executive and judicial officers of a state, or the members of the legislature thereof, is denied to any of the male inhabitants of such state, being twenty-one years of age, and citizens of the United States, or in any way abridged, except for participation in rebellion, or other crime, the basis of representation therein shall be reduced in the proportion which the number of such male citizens shall bear to the whole number of male citizens twenty-one years of age in such state.Section 3.No person shall be a Senator or Representative in Congress, or elector of President and Vice President, or hold any office, civil or military, under the United States, or under any state, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any state legislature, or as an executive or judicial officer of any state, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof. But Congress may by a vote of two-thirds of each House, remove such disability.Section 4.The validity of the public debt of the United States, authorized by law, including debts incurred for payment of pensions and bounties for services in suppressing insurrection or rebellion, shall not be questioned. But neither the United States nor any state shall assume or pay any debt or obligation incurred in aid of insurrection or rebellion against the United States, or any claim for the loss or emancipation of any slave; but all such debts, obligations and claims shall be held illegal and void.Section 5.The Congress shall have power to enforce, by appropriate legislation, the provisions of this article. wex resourcesSection 1.Privileges and Immunities ClauseCivil RightsSlaughterhouse CasesDue Process Substantive Due ProcessRight of Privacy: Personal AutonomyTerritorial JurisdictionEqual ProtectionPlessy v. Ferguson (1896)Plyer v. Doe (1982)Section 4.DebtSection 5.Enforcement Power Commerce Clause ‹ 13th Amendment up 15th Amendment › U.S. Constitution Toolbox Explanation of the Constitution - from the Congressional Research Service Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/constitution/amendmentxiv",
    "jurisdiction": "us_federal",
    "legal_domain": "constitutional_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu constitutional amendments",
      "search_rank": 5,
      "snippet": "The Fourteenth Amendment addresses many aspects of citizenship and the rights of citizens. The most commonly used -- and frequently litigated -- phrase in ..."
    },
    "created_at": "2025-08-01T17:04:29.902069",
    "content_hash": "0b5b0761bd35b2feb91561a598aab670"
  },
  {
    "id": "search_us_federal_statute_0_1754067872",
    "title": "U.S. Code: Title 26 — INTERNAL REVENUE CODE",
    "content": "U.S. Code: Title 26 — INTERNAL REVENUE CODE | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 26 Quick search by citation: Title Section Go! U.S. Code: Title 26 — INTERNAL REVENUE CODE U.S. Code Notes prev | next (Aug. 16, 1954, ch. 736, 68A Stat. 3; Pub. L. 99–514, § 2, Oct. 22, 1986, 100 Stat. 2095.) Subtitle A—Income Taxes (§§ 1 – 1564) Subtitle B—Estate and Gift Taxes (§§ 2001 – 2801) Subtitle C—Employment Taxes (§§ 3101 – 3512) Subtitle D—Miscellaneous Excise Taxes (§§ 4001 – 5000D) Subtitle E—Alcohol, Tobacco, and Certain Other Excise Taxes (§§ 5001 – 5891) Subtitle F—Procedure and Administration (§§ 6001 – 7874) Subtitle G—The Joint Committee on Taxation (§§ 8001 – 8023) Subtitle H—Financing of Presidential Election Campaigns (§§ 9001 – 9042) Subtitle I—Trust Fund Code (§§ 9500 – 9602) Subtitle J—Coal Industry Health Benefits (§§ 9701 – 9722) Subtitle K—Group Health Plan Requirements (§§ 9801 – 9834) Current through 119-4 Act Aug. 16, 1954, ch. 736, 68A Stat. 3 The following tables have been prepared as aids in comparing provisions of the Internal Revenue Code of 1954 (redesignated the Internal Revenue Code of 1986 by Pub. L. 99–514, § 2, Oct. 22, 1986, 100 Stat. 2095) with provisions of the Internal Revenue Code of 1939. No inferences, implications, or presumptions of legislative construction or intent are to be drawn or made by reason of such tables. Citations to “R.A.” refer to the sections of earlier Revenue Acts. Table I 1939 Code section number 1986 Code section number 1 Omitted 2 7806(a) 3, 4 Omitted 11 1 12(a), (b)(1), (2) Omitted 12(b)(3), (c) 1 12(d) 2 12(e) Omitted 12(f) 1 12(g), 13(a) Omitted 13(b) 11 13(c)–(f), 14 Omitted 15(a), (b) 11 15(c) 1551 21 63 22(a) 61 22(b)(1) 101 22(b)(2)(A) 72 22(b)(2)(B) 72, 403 22(b)(2)(C) 72 22(b)(3)–(5) 102–104 22(b)(6) 107 22(b)(7) 894 22(b)(8) 115, 526, 892, 893, 911, 912, 933, 943 22(b)(9), (10) 108 22(b)(11)–(14) 109, 111–113 22(b)(15) 621 22(b)(16), (17) 114, 121 22(c) 471 22(d)(1)–(5) 472 22(d)(6) 1321, 6155(a) 22(e) 301(a) 22(f) 1001 22(g) 861, 862, 863, 864 22(h) Chapter 1, Subchapter G, Part III 22(i) Omitted 22(j) 76 22(k) 71 22(l) 691 22(m) 73, 6201(c) 22(n) 62 22(o) 75 23 161, 211 23(a)(1)(A), (B) 162 23(a)(1)(C) 263 23(a)(2) 212 23(b) 163, 265 23(c)(1) 164 23(c)(2) Omitted 23(c)(3), (d) 164 23(e)–(i) 165 23(j) 1091 23(k)(1) 166, 593 23(k)(2) 165(g)(1), 166(e), 582 23(k)(3) 165(g)(2) 23(k)(4), (5) 166 23(k)(6) 166, 271 23(l) 167 23(m) 611 23(n) 167 23(o) 170 23(p) 404 23(q) 170 23(r) 591 23(s) 172 23(t) 168, 169 23(u) 215 23(v) 171 23(w) 691 23(x) 213 23(y) Omitted 23(z) 216 23(aa)(1) 141 23(aa)(2) 36 23(aa)(3) 144 23(aa)(4) 4, 142 23(aa)(5)–(7) 142–144 23(bb) 173 23(cc) 616 23(dd) 592 23(ee) 1202 23(ff) 615 24(a) 261 24(a)(1) 262 24(a)(2), (3) 263 24(a)(4), (5) 264, 265 24(a)(6) 264 24(a)(7) 266 24(b), (c) 267 24(d) 273 24(e) 1451 24(f) 268 25(a) 35 25(b)(1) 151 25(b)(2) 153 25(b)(3) 152 26 241 26(a) 242 26(b)(1)–(3) 243–245 26(b) 246 26(c) 545, 556 26(d) 535, 545, 601 26(e) Omitted 26(f) 561, 562, 564 26(g) 565 26(h) 247 26(i) 922 27(a) 561 27(b) 535, 562 27(c)–(i) 562, 564 28 565 31 33 32 32 33 6401 34 Omitted 35 31 41 441, 446 42(a) 451 42(b)–(d) 454 43 461 44 453, 7101 45 482 46 442 47 443, 6011(a) 48 441, 7701 51 6001, 6011(a) 51(a) 6001, 6012(a), 6065(b) 51(b) 6012(b)(1), 6013(a), 6014(b) 51(c) 6012(b) 51(d) Omitted. See 6064. 51(e) 6065(a) 51(f) 6014(a), (b), 6151(a), (b), 6155(a) 51(g) 6012(b), 6013(b), 6653(a), 6659 52 6012(a), (b), 6062 53 6072, 6081, 6091 54(a)–(b) 6001 54(c)–(e) Omitted 54(f) 6033(a), 6065(b) 55 6103, 7213(a) 56(a) 6151(a) 56(b) 6152, 6601(c)(2) 56(c) 6161(a), 6162(a), 6165, 7101 56(d)–(f) Omitted 56(g) 6313 56(h) Omitted 56(i) 6151(b) 56(j), 57 Omitted 58 6012(b), 6015, 6064, 6065, 6073(a), (c), 6081(a), 6091(b), 6103, 6161(a) 59(a)–(c) 6153 59(d) 6201(b), 6315, 6601(g) 60 6015(g), 6073(b), (d), (e), 6091(b), 6153(b), (d), (e) 61 Omitted 62 7805 63 6108 64 7701 101(1)–(11), (13)–(19) 501 101(12) 521, 522 101 502 102(a) 531, 532 102(b), (c) 533 102(d), (e) 535, 541 102(f) 536 103 891 104(a) 581 104(b) 11 105 632 106 1347 107(a), (b) 1301, 1302 107(c) 1304(a) 107(d) 1303 107(e) 1304(b) 108 21 109 921 110 594 111 1001 112(a) 1002 112(b)(1) 1031 112(b)(2) 103...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/26",
    "jurisdiction": "us_federal",
    "legal_domain": "taxation_financial",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal tax code regulations",
      "search_rank": 1,
      "snippet": "U.S. Code: Title 26 — INTERNAL REVENUE CODE · Subtitle A—Income Taxes (§§ 1 – 1564) · Subtitle B—Estate and Gift Taxes (§§ 2001 – 2801) · Subtitle C—Employment ..."
    },
    "created_at": "2025-08-01T17:04:32.619827",
    "content_hash": "9be3f417a03e6a9b4904e7788f657c9a"
  },
  {
    "id": "search_us_federal_statute_1_1754067872",
    "title": "26 CFR Chapter I - INTERNAL REVENUE SERVICE ...",
    "content": "26 CFR Chapter I - INTERNAL REVENUE SERVICE, DEPARTMENT OF THE TREASURY | Electronic Code of Federal Regulations (e-CFR) | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Electronic Code of Federal Regulations (e-CFR) Title 26—Internal Revenue CHAPTER I—INTERNAL REVENUE SERVICE, DEPARTMENT OF THE TREASURY 26 CFR Chapter I - INTERNAL REVENUE SERVICE, DEPARTMENT OF THE TREASURY CFR SUBCHAPTER A—INCOME TAX (Parts 1 - 18) SUBCHAPTER B—ESTATE AND GIFT TAXES (Parts 20 - 29) SUBCHAPTER C—EMPLOYMENT TAXES AND COLLECTION OF INCOME TAX AT SOURCE (Parts 30 - 37-39) SUBCHAPTER D—MISCELLANEOUS EXCISE TAXES (Parts 40 - 158-169) SUBCHAPTER E [RESERVED] PARTS 170-299 [RESERVED] SUBCHAPTER F—PROCEDURE AND ADMINISTRATION (Parts 300 - 421-499) SUBCHAPTER G—REGULATIONS UNDER TAX CONVENTIONS (Parts 500-507 - 522-599) SUBCHAPTER H—INTERNAL REVENUE PRACTICE (Parts 600 - 802-899) CFR Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/cfr/text/26/chapter-I",
    "jurisdiction": "us_federal",
    "legal_domain": "taxation_financial",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal tax code regulations",
      "search_rank": 2,
      "snippet": "26 CFR Chapter I - INTERNAL REVENUE SERVICE, DEPARTMENT OF THE TREASURY · SUBCHAPTER A—INCOME TAX (Parts 1 - 18) · SUBCHAPTER B—ESTATE AND GIFT TAXES (Parts 20 - ..."
    },
    "created_at": "2025-08-01T17:04:32.901949",
    "content_hash": "eb0b1cdfb7f7d70b664e6bc25cbd3acc"
  },
  {
    "id": "search_us_federal_statute_2_1754067873",
    "title": "IRS regulations | Wex | US Law | LII / Legal Information Institute",
    "content": "IRS regulations | Wex | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Wex IRS regulations IRS regulationsIRS regulations, also known as treasury regulations or tax regulations, are the regulations issued by the Internal Revenue Services (IRS) to interpret the Internal Revenue Code (IRC).The Department of the Treasury issues regulations to interpret and enforce the IRC. More specifically, section 7805(a) of the IRC authorizes the Secretary of the Treasury to create rules and regulations necessary to enforce the IRC. IRS regulations may not create new taxes or enlarge taxing statutes in their interpretations of the IRC. If an IRS regulation’s interpretation of the IRC is found in contrast with the IRC’s statutory language, the regulation may be struck down by a federal court. However, the courts often defer to an agent, like the Secretary of the Treasury’s interpretations of statutory language. The IRS issues three types of regulations: proposed, temporary, and final regulations.Proposed regulations are announced by the IRS to the public via a Notice of Proposed Rulemaking (NPRM). These regulations do not yet have the force of law and may ultimately be altered or canceled entirely before becoming effective final regulations. The public can submit comments to the IRS regarding proposed regulations.Temporary regulations are created to provide immediate guidance to the public prior to the publication of final regulations. Temporary regulations are effective when published in the Federal Register but expire within three years of issuance.Final regulations are effective regulations issued with the force of law after the IRS has considered and responded to public comments on proposed regulations through their NPRMs.A temporary or final regulation is published as a Treasury Decision (TD). A TD includes the regulation’s text and a preamble explaining the regulation. A TD is binding on both taxpayers and the IRS. TDs, excluding their explanatory preambles, are published in Title 26 of the Code of  Federal Register (CFR).[Last reviewed in June of 2024 by the Wex Definitions Team]WexCIVICS taxation wex definitions government tax Wex Toolbox Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/wex/irs_regulations",
    "jurisdiction": "us_federal",
    "legal_domain": "corporate_regulatory",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal tax code regulations",
      "search_rank": 3,
      "snippet": "IRS regulations, also known as treasury regulations or tax regulations, are the regulations issued by the Internal Revenue Services (IRS) to interpret the ..."
    },
    "created_at": "2025-08-01T17:04:33.069458",
    "content_hash": "fbe2e01cb5e2f842e077993f2b0b774c"
  },
  {
    "id": "search_us_federal_statute_3_1754067873",
    "title": "26 CFR Part 1 - INCOME TAXES - Law.Cornell.Edu",
    "content": "26 CFR Part 1 - INCOME TAXES | Electronic Code of Federal Regulations (e-CFR) | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Electronic Code of Federal Regulations (e-CFR) Title 26—Internal Revenue CHAPTER I—INTERNAL REVENUE SERVICE, DEPARTMENT OF THE TREASURY SUBCHAPTER A—INCOME TAX PART 1—INCOME TAXES 26 CFR Part 1 - INCOME TAXES CFR prev | next § 1.0-1 Internal Revenue Code of 1954 and regulations. Normal Taxes and Surtaxes (§§ 1.1-1 - 1.1563-4) § 1.1-1 Income tax on individuals. § 1.1-2 Limitation on tax. § 1.1-3 Change in rates applicable to taxable year. § 1.1(h)-1 Capital gains look-through rule for sales or exchanges of interests in a partnership, S corporation, or trust. § 1.1(i)-1T Questions and answers relating to the tax on unearned income certain minor children (Temporary). § 1.2-1 Tax in case of joint return of husband and wife or the return of a surviving spouse. § 1.2-2 Definitions and special rules. § 1.3-1 Application of optional tax. § 1.4-1 Number of exemptions. § 1.4-2 Elections. § 1.4-3 Husband and wife filing separate returns. § 1.4-4 Short taxable year caused by death. § 1.141-1 Definitions and rules of general application. § 1.141-2 Private activity bond tests. § 1.141-3 Definition of private business use. § 1.141-4 Private security or payment test. § 1.141-5 Private loan financing test. § 1.141-6 Allocation and accounting rules. § 1.141-7 Special rules for output facilities. § 1.141-8 $15 million limitation for output facilities. § 1.141-9 Unrelated or disproportionate use test. § 1.141-10 Coordination with volume cap. [Reserved] § 1.141-11 Acquisition of nongovernmental output property. [Reserved] § 1.141-12 Remedial actions. § 1.141-13 Refunding issues. § 1.141-14 Anti-abuse rules. § 1.141-15 Effective/applicability dates. § 1.141-16 Effective dates for qualified private activity bond provisions. § 1.142-0 Table of contents. § 1.142-1 Exempt facility bonds. § 1.142-2 Remedial actions. § 1.142-3 Refunding Issues. [Reserved] § 1.142-4 Use of proceeds to provide a facility. § 1.142(a)(5)-1 Exempt facility bonds: Sewage facilities. § 1.142(a)(6)-1 Exempt facility bonds: solid waste disposal facilities. § 1.142(f)(4)-1 Manner of making election to terminate tax-exempt bond financing. § 1.143(g)-1 Requirements related to arbitrage. § 1.144-0 Table of contents. § 1.144-1 Qualified small issue bonds, qualified student loan bonds, and qualified redevelopment bonds. § 1.144-2 Remedial actions. § 1.145-0 Table of contents. § 1.145-1 Qualified 501(c)(3) bonds. § 1.145-2 Application of private activity bond regulations. § 1.147-0 Table of contents. § 1.147-1 Other requirements applicable to certain private activity bonds. § 1.147-2 Remedial actions. § 1.147(b)-1 Bond maturity limitation-treatment of working capital. § 1.147(f)-1 Public approval of private activity bonds. § 1.148-0 Scope and table of contents. § 1.148-1 Definitions and elections. § 1.148-2 General arbitrage yield restriction rules. § 1.148-3 General arbitrage rebate rules. § 1.148-4 Yield on an issue of bonds. § 1.148-5 Yield and valuation of investments. § 1.148-6 General allocation and accounting rules. § 1.148-7 Spending exceptions to the rebate requirement. § 1.148-8 Small issuer exception to rebate requirement. § 1.148-9 Arbitrage rules for refunding issues. § 1.148-10 Anti-abuse rules and authority of Commissioner. § 1.148-11 Effective/applicability dates. § 1.149(b)-1 Federally guaranteed bonds. § 1.149(d)-1 Limitations on advance refundings. § 1.149(e)-1 Information reporting requirements for tax-exempt bonds. § 1.149(g)-1 Hedge bonds. § 1.150-1 Definitions. § 1.150-2 Proceeds of bonds used for reimbursement. § 1.150-3 Retirement standards for state and local bonds. § 1.150-4 Change in use of facilities financed with tax-exempt private activity bonds. § 1.150-5 Filing notices and elections. § 1.501(a)-1 Exemption from taxation. § 1.501(c)(2)-1 Corporations organized to hold title to property for exempt organizations. § 1.501(c)(3)-1 Organizations organized and operated for religious, charitable, scientific, testing for public safety, literary, or educational purposes, or for the prevention of cruelty to children or animals. § 1.501(c)(4)-1 Civic organizations and local associations of ...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/cfr/text/26/part-1",
    "jurisdiction": "us_federal",
    "legal_domain": "taxation_financial",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal tax code regulations",
      "search_rank": 4,
      "snippet": "§ 1.0-1 Internal Revenue Code of 1954 and regulations. Normal Taxes and Surtaxes (§§ 1.1-1 - 1.1563-4). § 1.1-1 Income tax on ..."
    },
    "created_at": "2025-08-01T17:04:33.694295",
    "content_hash": "8890e0243bf4ba1af5c60657bb453562"
  },
  {
    "id": "search_us_federal_statute_4_1754067874",
    "title": "26 U.S. Code § 1 - Tax imposed - Law.Cornell.Edu",
    "content": "26 U.S. Code § 1 - Tax imposed | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 26 Subtitle A CHAPTER 1 Subchapter A PART I § 1 Quick search by citation: Title Section Go! 26 U.S. Code § 1 - Tax imposed U.S. Code Notes Authorities (CFR) prev | next (a) Married individuals filing joint returns and surviving spousesThere is hereby imposed on the taxable income of— (1) every married individual (as defined in section 7703) who makes a single return jointly with his spouse under section 6013, and (2) every surviving spouse (as defined in section 2(a)), a tax determined in accordance with the following table: If taxable income is: The tax is: Not over $36,900 15% of taxable income. Over $36,900 but not over $89,150 $5,535, plus 28% of the excess over $36,900. Over $89,150 but not over $140,000 $20,165, plus 31% of the excess over $89,150. Over $140,000 but not over $250,000 $35,928.50, plus 36% of the excess over $140,000. Over $250,000 $75,528.50, plus 39.6% of the excess over $250,000. (b) Heads of households There is hereby imposed on the taxable income of every head of a household (as defined in section 2(b)) a tax determined in accordance with the following table: If taxable income is: The tax is: Not over $29,600 15% of taxable income. Over $29,600 but not over $76,400 $4,440, plus 28% of the excess over $29,600. Over $76,400 but not over $127,500 $17,544, plus 31% of the excess over $76,400. Over $127,500 but not over $250,000 $33,385, plus 36% of the excess over $127,500. Over $250,000 $77,485, plus 39.6% of the excess over $250,000. (c) Unmarried individuals (other than surviving spouses and heads of households) There is hereby imposed on the taxable income of every individual (other than a surviving spouse as defined in section 2(a) or the head of a household as defined in section 2(b)) who is not a married individual (as defined in section 7703) a tax determined in accordance with the following table: If taxable income is: The tax is: Not over $22,100 15% of taxable income. Over $22,100 but not over $53,500 $3,315, plus 28% of the excess over $22,100. Over $53,500 but not over $115,000 $12,107, plus 31% of the excess over $53,500. Over $115,000 but not over $250,000 $31,172, plus 36% of the excess over $115,000. Over $250,000 $79,772, plus 39.6% of the excess over $250,000. (d) Married individuals filing separate returns There is hereby imposed on the taxable income of every married individual (as defined in section 7703) who does not make a single return jointly with his spouse under section 6013, a tax determined in accordance with the following table: If taxable income is: The tax is: Not over $18,450 15% of taxable income. Over $18,450 but not over $44,575 $2,767.50, plus 28% of the excess over $18,450. Over $44,575 but not over $70,000 $10,082.50, plus 31% of the excess over $44,575. Over $70,000 but not over $125,000 $17,964.25, plus 36% of the excess over $70,000. Over $125,000 $37,764.25, plus 39.6% of the excess over $125,000. (e) Estates and trustsThere is hereby imposed on the taxable income of— (1) every estate, and (2) every trust, taxable under this subsection a tax determined in accordance with the following table: If taxable income is: The tax is: Not over $1,500 15% of taxable income. Over $1,500 but not over $3,500 $225, plus 28% of the excess over $1,500. Over $3,500 but not over $5,500 $785, plus 31% of the excess over $3,500. Over $5,500 but not over $7,500 $1,405, plus 36% of the excess over $5,500. Over $7,500 $2,125, plus 39.6% of the excess over $7,500. (f) Phaseout of marriage penalty in 15-percent bracket; adjustments in tax tables so that inflation will not result in tax increases (1) In general Not later than December 15 of 1993, and each subsequent calendar year, the Secretary shall prescribe tables which shall apply in lieu of the tables contained in subsections (a), (b), (c), (d), and (e) with respect to taxable years beginning in the succeeding calendar year. (2) Method of prescribing tablesThe table which under paragraph (1) is to apply in lieu of the table contained in subsection (a), (b), (c), (d), or (e), as the case may be, with respect to taxable years beginning in any calendar year shall be prescribed— (...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/26/1",
    "jurisdiction": "us_federal",
    "legal_domain": "taxation_financial",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal tax code regulations",
      "search_rank": 5,
      "snippet": "If taxable income is: The tax is: Not over $36,900. 15% of taxable income. Over $36,900 but not over $89,150. $5,535, plus 28% of the excess over $36,900."
    },
    "created_at": "2025-08-01T17:04:34.215960",
    "content_hash": "884fccb6657bdf0da124c474af25c7c3"
  },
  {
    "id": "search_us_federal_statute_0_1754067875",
    "title": "real estate transactions | Wex - Law.Cornell.Edu",
    "content": "real estate transactions | Wex | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Wex real estate transactions real estate transactionsreal estate transactions: an overviewReal estate transactions are governed by a wide body of federal statutes and a combination of state statutes and common law. The requirements established by state law often differ significantly from one state to the next.Real estate brokers are employed as the agent of the seller in order to obtain a buyer for their property. See Agency. The contract between the broker and seller is called a listing agreement. The agreement may be an open agreement whereby the broker earns a commission only if he or she finds a buyer. A listing is exclusive if the broker is the only agent entitled to a commission for finding a buyer. Under an exclusive arrangement, a broker may be entitled to a payment even if the seller finds the buyer without the brokers aid. Real estate brokers and salesperson are licensed and regulated by local state laws. See, e.g., California Civil Code § 2079. Professional organizations may also provide further guidelines.The Federal Fair Housing Act prohibits discrimination in real estate transactions on account of race, color, religion, sex, or national origin. See 42 U.S.C. §§ 3601-3631. Real estate brokers are specifically prohibited from discriminating by the act. See § 3606 of the act.The agreement to sell between a buyer and seller of real estate is governed by the general principles of contract law. See Contracts. The Statute of Frauds requires that contracts for real property be in writing. See, e.g., California Civil Code § 1624.It is commonly required in real estate contracts that the title to the property sold be marketable. This requires that the seller have proof of title to all the property he or she is selling and that third parties not have undisclosed interests in the title. See Real property.A title insurance company or an attorney is often employed by the buyer to investigate whether the title is, indeed, marketable. Title insurance companies also insure the buyer against losses caused by the title being invalid.In order to pass title, a deed with a proper description of the land must be executed and delivered. Some states require that the deed be officially recorded to establish ownership of the property and/or provide notice of its transfer to subsequent purchasers.The most common method of financing real estate transactions is through a mortgage. See also: WexPROPERTY property & real estate law wex articles property lawMortgageU.S. Code: 42 U.S.C., Chapter 45 - Federal Fair Housing ActState Property Statutes Wex Toolbox Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/wex/real_estate_transactions",
    "jurisdiction": "us_federal",
    "legal_domain": "employment_labor_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal real estate laws",
      "search_rank": 1,
      "snippet": "The Federal Fair Housing Act prohibits discrimination in real estate transactions on account of race, color, religion, sex, or national origin. See 42 U.S.C. §§ ..."
    },
    "created_at": "2025-08-01T17:04:35.464599",
    "content_hash": "d34757e6e1f6d6e870db89aeac29fb4b"
  },
  {
    "id": "search_us_federal_statute_1_1754067875",
    "title": "24 CFR § 266.400 - real estate. - Law.Cornell.Edu",
    "content": "24 CFR § 266.400 - real estate. | Electronic Code of Federal Regulations (e-CFR) | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Electronic Code of Federal Regulations (e-CFR) Title 24—Housing and Urban Development Subtitle B—Regulations Relating to Housing and Urban Development CHAPTER II—OFFICE OF ASSISTANT SECRETARY FOR HOUSING—FEDERAL HOUSING COMMISSIONER, DEPARTMENT OF HOUSING AND URBAN DEVELOPMENT SUBCHAPTER B—MORTGAGE AND LOAN INSURANCE PROGRAMS UNDER NATIONAL HOUSING ACT AND OTHER AUTHORITIES PART 266—HOUSING FINANCE AGENCY RISK-SHARING PROGRAM FOR INSURED AFFORDABLE MULTIFAMILY PROJECT LOANS Subpart E—Mortgage and Closing Requirements; HUD Endorsement § 266.400 Property requirements—real estate. 24 CFR § 266.400 - real estate. CFR prev | next § 266.400 Property requirements—real estate. The mortgage must be on real estate held: (a) In fee simple; (b) Under a renewable lease of not less than 99 years; or (c) Under a lease executed by a governmental agency, or other lessor approved by the HFA, that has a term at least 10 years beyond the end of the mortgage term. CFR Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/cfr/text/24/266.400",
    "jurisdiction": "us_federal",
    "legal_domain": "real_estate_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal real estate laws",
      "search_rank": 2,
      "snippet": "The mortgage must be on real estate held: (a) In fee simple;. (b) Under a renewable lease of not less than 99 years; or."
    },
    "created_at": "2025-08-01T17:04:35.631484",
    "content_hash": "6c59455b9086c3d6bab631d7e82c4810"
  },
  {
    "id": "search_us_federal_statute_2_1754067875",
    "title": "12 CFR § 141.23 - Residential real estate. - Law.Cornell.Edu",
    "content": "12 CFR § 141.23 - Residential real estate. | Electronic Code of Federal Regulations (e-CFR) | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII Electronic Code of Federal Regulations (e-CFR) Title 12—Banks and Banking CHAPTER I—COMPTROLLER OF THE CURRENCY, DEPARTMENT OF THE TREASURY PART 141—DEFINITIONS FOR REGULATIONS AFFECTING FEDERAL SAVINGS ASSOCIATIONS § 141.23 Residential real estate. 12 CFR § 141.23 - Residential real estate. CFR prev | next § 141.23 Residential real estate. The terms residential real estate or residential real property mean: (a) Homes (including a dwelling unit in a multi-family residential property such as a condominium or a cooperative); (b) Combinations of homes and business property (i.e., a home used in part for business); (c) Other real estate used for primarily residential purposes other than a home (but which may include homes); (d) Combinations of such real estate and business property involving only minor business use (i.e., where no more than 20 percent of the total appraised value of the real estate is attributable to the business use); (e) Farm residences and combinations of farm residences and commercial farm real estate; (f) Property to be improved by the construction of such structures; or (g) Leasehold interests in the above real estate. CFR Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/cfr/text/12/141.23",
    "jurisdiction": "us_federal",
    "legal_domain": "real_estate_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal real estate laws",
      "search_rank": 3,
      "snippet": "12 CFR § 141.23 - Residential real estate. · (a) Homes (including a dwelling unit in a multi-family residential property such as a condominium or a cooperative);."
    },
    "created_at": "2025-08-01T17:04:35.796460",
    "content_hash": "2376689c582ed6c8669bf50baa4f1c6a"
  },
  {
    "id": "search_us_federal_statute_3_1754067876",
    "title": "12 U.S. Code Chapter 27 - REAL ESTATE SETTLEMENT ...",
    "content": "12 U.S. Code Chapter 27 - REAL ESTATE SETTLEMENT PROCEDURES | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 12 CHAPTER 27 Quick search by citation: Title Section Go! 12 U.S. Code Chapter 27 - REAL ESTATE SETTLEMENT PROCEDURES U.S. Code prev | next § 2601. Congressional findings and purpose § 2602. Definitions § 2603. Uniform settlement statement § 2604. Home buying information booklets § 2605. Servicing of mortgage loans and administration of escrow accounts § 2606. Exempted transactions § 2607. Prohibition against kickbacks and unearned fees § 2608. Title companies; liability of seller § 2609. Limitation on requirement of advance deposits in escrow accounts § 2610. Prohibition of fees for preparation of truth-in-lending, uniform settlement, and escrow account statements §§ 2611 to 2613. Repealed. Pub. L. 104–208, div. A, title II, § 2103(h), Sept. 30, 1996, 110 Stat. 3009–401 § 2614. Jurisdiction of courts; limitations § 2615. Contracts and liens; validity § 2616. State laws unaffected; inconsistent Federal and State provisions § 2617. Authority of Bureau U.S. Code Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities How current is this? Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/12/chapter-27",
    "jurisdiction": "us_federal",
    "legal_domain": "real_estate_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal real estate laws",
      "search_rank": 4,
      "snippet": "12 U.S. Code Chapter 27 - REAL ESTATE SETTLEMENT PROCEDURES · § 2601. Congressional findings and purpose · § 2602. Definitions · § 2603. Uniform settlement ..."
    },
    "created_at": "2025-08-01T17:04:36.061906",
    "content_hash": "f7dfc12cae2b43d64b585794e00bfe58"
  },
  {
    "id": "search_us_federal_statute_4_1754067876",
    "title": "12 U.S. Code § 29 - Power to hold real property",
    "content": "12 U.S. Code § 29 - Power to hold real property | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 12 CHAPTER 2 SUBCHAPTER I § 29 Quick search by citation: Title Section Go! 12 U.S. Code § 29 - Power to hold real property U.S. Code Notes Authorities (CFR) prev | next A national banking association may purchase, hold, and convey real estate for the following purposes, and for no others: First. Such as shall be necessary for its accommodation in the transaction of its business. Second. Such as shall be mortgaged to it in good faith by way of security for debts previously contracted. Third. Such as shall be conveyed to it in satisfaction of debts previously contracted in the course of its dealings. Fourth. Such as it shall purchase at sales under judgments, decrees, or mortgages held by the association, or shall purchase to secure debts due to it. But no such association shall hold the possession of any real estate under mortgage, or the title and possession of any real estate purchased to secure any debts due to it, for a longer period than five years except as otherwise provided in this section. For real estate in the possession of a national banking association upon application by the association, the Comptroller of the Currency may approve the possession of any such real estate by such association for a period longer than five years, but not to exceed an additional five years, if (1) the association has made a good faith attempt to dispose of the real estate within the five-year period, or (2) disposal within the five-year period would be detrimental to the association. Upon notification by the association to the Comptroller of the Currency that such conditions exist that require the expenditure of funds for the development and improvement of such real estate, and subject to such conditions and limitations as the Comptroller of the Currency shall prescribe, the association may expend such funds as are needed to enable such association to recover its total investment. Notwithstanding the five-year holding limitation of this section or any other provision of title 62 of the Revised Statutes, any national banking association which on October 15, 1982, held, directly or indirectly, real estate, including any subsurface rights or interests therein, that since December 31, 1979, had not been valued on the books of such association for more than a nominal amount, may continue to hold such real estate, rights, or interests for such longer period of time as would be permitted a State chartered bank by the law of the State in which the association is located if the aggregate amount of earnings from such real estate, rights, or interests is separately disclosed in the annual financial statements of the association. (R.S. § 5137; Feb. 25, 1927, ch. 191, § 3, 44 Stat. 1227; Pub. L. 96–221, title VII, § 701(a), Mar. 31, 1980, 94 Stat. 186; Pub. L. 97–25, title III, § 302, July 27, 1981, 95 Stat. 145; Pub. L. 97–320, title IV, § 413, Oct. 15, 1982, 96 Stat. 1521.) Editorial Notes References in Text Title 62 of the Revised Statutes, referred to in last par., was in the original “this title” meaning title LXII of the Revised Statutes, consisting of R.S. §§ 5133 to 5244, which are classified to this section and sections 16, 21, 22 to 24a, 25a, 25b, 26, 27, 35 to 37, 39, 43, 52, 53, 55 to 57, 59 to 62, 66, 71, 72 to 76, 81, 83 to 86, 90, 91, 93, 93a, 94, 141 to 144, 161, 164, 181, 182, 192 to 194, 196, 215c, 481 to 485, 501, 541, 548, and 582 of this title. See, also, sections 8, 333, 334, 475, 656, 709, 1004, and 1005 of Title 18, Crimes and Criminal Procedure. For complete classification of R.S. §§ 5133 to 5244 to the Code, see Tables. Codification R.S. § 5137 derived from act June 3, 1864, ch. 106, § 28, 13 Stat. 107, which was the National Bank Act. See section 38 of this title. Amendments 1982—Pub. L. 97–320 substituted “Notwithstanding the five-year holding limitation of this section or any other provision of title 62 of the Revised Statutes, any national banking association which on October 15, 1982, held, directly or indirectly, real estate, including any subsurface rights or interests therein, that since December 31, 1979, had not been valued on the books of ...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/12/29",
    "jurisdiction": "us_federal",
    "legal_domain": "real_estate_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal real estate laws",
      "search_rank": 5,
      "snippet": "A national banking association may purchase, hold, and convey real estate for the following purposes, and for no others."
    },
    "created_at": "2025-08-01T17:04:36.230526",
    "content_hash": "b93f2e2c2cca88ad4c547946d3317f22"
  },
  {
    "id": "search_us_federal_statute_0_1754067877",
    "title": "8 U.S. Code Chapter 12 - IMMIGRATION AND NATIONALITY",
    "content": "8 U.S. Code Chapter 12 - IMMIGRATION AND NATIONALITY | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 8 CHAPTER 12 Quick search by citation: Title Section Go! 8 U.S. Code Chapter 12 - IMMIGRATION AND NATIONALITY U.S. Code prev | next SUBCHAPTER I—GENERAL PROVISIONS (§§ 1101 – 1107) SUBCHAPTER II—IMMIGRATION (§§ 1151 – 1382) SUBCHAPTER III—NATIONALITY AND NATURALIZATION (§§ 1401 – 1504) SUBCHAPTER IV—REFUGEE ASSISTANCE (§§ 1521 – 1525) SUBCHAPTER V—ALIEN TERRORIST REMOVAL PROCEDURES (§§ 1531 – 1537) U.S. Code Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities How current is this? Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/8/chapter-12",
    "jurisdiction": "us_federal",
    "legal_domain": "immigration_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal immigration statutes",
      "search_rank": 1,
      "snippet": "8 U.S. Code Chapter 12 - IMMIGRATION AND NATIONALITY · SUBCHAPTER I—GENERAL PROVISIONS (§§ 1101 – 1107) · SUBCHAPTER II—IMMIGRATION (§§ 1151 – 1382) ..."
    },
    "created_at": "2025-08-01T17:04:37.506294",
    "content_hash": "8f3603ee071e18ce080f05f6335e3790"
  },
  {
    "id": "search_us_federal_statute_1_1754067877",
    "title": "8 U.S. Code § 1325 - Improper entry by alien - Law.Cornell.Edu",
    "content": "8 U.S. Code § 1325 - Improper entry by alien | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 8 CHAPTER 12 SUBCHAPTER II Part VIII § 1325 Quick search by citation: Title Section Go! 8 U.S. Code § 1325 - Improper entry by alien U.S. Code Notes prev | next (a) Improper time or place; avoidance of examination or inspection; misrepresentation and concealment of facts Any alien who (1) enters or attempts to enter the United States at any time or place other than as designated by immigration officers, or (2) eludes examination or inspection by immigration officers, or (3) attempts to enter or obtains entry to the United States by a willfully false or misleading representation or the willful concealment of a material fact, shall, for the first commission of any such offense, be fined under title 18 or imprisoned not more than 6 months, or both, and, for a subsequent commission of any such offense, be fined under title 18, or imprisoned not more than 2 years, or both. (b) Improper time or place; civil penaltiesAny alien who is apprehended while entering (or attempting to enter) the United States at a time or place other than as designated by immigration officers shall be subject to a civil penalty of— (1) at least $50 and not more than $250 for each such entry (or attempted entry); or (2) twice the amount specified in paragraph (1) in the case of an alien who has been previously subject to a civil penalty under this subsection. Civil penalties under this subsection are in addition to, and not in lieu of, any criminal or other civil penalties that may be imposed. (c) Marriage fraud Any individual who knowingly enters into a marriage for the purpose of evading any provision of the immigration laws shall be imprisoned for not more than 5 years, or fined not more than $250,000, or both. (d) Immigration-related entrepreneurship fraud Any individual who knowingly establishes a commercial enterprise for the purpose of evading any provision of the immigration laws shall be imprisoned for not more than 5 years, fined in accordance with title 18, or both. (June 27, 1952, ch. 477, title II, ch. 8, § 275, 66 Stat. 229; Pub. L. 99–639, § 2(d), Nov. 10, 1986, 100 Stat. 3542; Pub. L. 101–649, title I, § 121(b)(3), title V, § 543(b)(2), Nov. 29, 1990, 104 Stat. 4994, 5059; Pub. L. 102–232, title III, § 306(c)(3), Dec. 12, 1991, 105 Stat. 1752; Pub. L. 104–208, div. C, title I, § 105(a), Sept. 30, 1996, 110 Stat. 3009–556.) Editorial Notes Amendments 1996—Subsecs. (b) to (d). Pub. L. 104–208 added subsec. (b) and redesignated former subsecs. (b) and (c) as (c) and (d), respectively. 1991—Subsec. (a). Pub. L. 102–232 substituted “fined under title 18” for “fined not more than $2,000 (or, if greater, the amount provided under title 18)”. 1990—Subsec. (a). Pub. L. 101–649, § 543(b)(2), inserted “or attempts to enter” after “(1) enters” and “attempts to enter or” after “or (3)”, and substituted “shall, for the first commission of any such offense, be fined not more than $2,000 (or, if greater, the amount provided under title 18) or imprisoned not more than 6 months, or both, and, for a subsequent commission of any such offense, be fined under title 18, or imprisoned not more than 2 years” for “shall, for the first commission of any such offenses, be guilty of a misdemeanor and upon conviction thereof be punished by imprisonment for not more than six months, or by a fine of not more than $500, or by both, and for a subsequent commission of any such offenses shall be guilty of a felony and upon conviction thereof shall be punished by imprisonment for not more than two years, or by a fine of not more than $1,000”. Subsec. (c). Pub. L. 101–649, § 121(b)(3), added subsec. (c). 1986—Pub. L. 99–639 designated existing provisions as subsec. (a) and added subsec. (b). Statutory Notes and Related Subsidiaries Effective Date of 1996 Amendment Pub. L. 104–208, div. C, title I, § 105(b), Sept. 30, 1996, 110 Stat. 3009–556, provided that: “The amendments made by subsection (a) [amending this section] shall apply to illegal entries or attempts to enter occurring on or after the first day of the sixth month beginning after the date of the enactment of this Act [Sept. 30, 1996].” Effective Dat...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/8/1325",
    "jurisdiction": "us_federal",
    "legal_domain": "immigration_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal immigration statutes",
      "search_rank": 2,
      "snippet": "Any alien who (1) enters or attempts to enter the United States at any time or place other than as designated by immigration officers, or (2) eludes ..."
    },
    "created_at": "2025-08-01T17:04:37.680002",
    "content_hash": "3b2d57a1b6616fe2082d529c8fbf54b2"
  },
  {
    "id": "search_us_federal_statute_2_1754067877",
    "title": "8 U.S. Code § 1373 | US Law | LII / Legal Information Institute",
    "content": "8 U.S. Code § 1373 - Communication between government agencies and the Immigration and Naturalization Service | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 8 CHAPTER 12 SUBCHAPTER II Part IX § 1373 Quick search by citation: Title Section Go! 8 U.S. Code § 1373 - Communication between government agencies and the Immigration and Naturalization Service U.S. Code Notes prev | next (a) In general Notwithstanding any other provision of Federal, State, or local law, a Federal, State, or local government entity or official may not prohibit, or in any way restrict, any government entity or official from sending to, or receiving from, the Immigration and Naturalization Service information regarding the citizenship or immigration status, lawful or unlawful, of any individual. (b) Additional authority of government entitiesNotwithstanding any other provision of Federal, State, or local law, no person or agency may prohibit, or in any way restrict, a Federal, State, or local government entity from doing any of the following with respect to information regarding the immigration status, lawful or unlawful, of any individual: (1) Sending such information to, or requesting or receiving such information from, the Immigration and Naturalization Service. (2) Maintaining such information. (3) Exchanging such information with any other Federal, State, or local government entity. (c) Obligation to respond to inquiries The Immigration and Naturalization Service shall respond to an inquiry by a Federal, State, or local government agency, seeking to verify or ascertain the citizenship or immigration status of any individual within the jurisdiction of the agency for any purpose authorized by law, by providing the requested verification or status information. (Pub. L. 104–208, div. C, title VI, § 642, Sept. 30, 1996, 110 Stat. 3009–707.) Editorial Notes Codification Section was enacted as part of the Illegal Immigration Reform and Immigrant Responsibility Act of 1996, and also as part of the Omnibus Consolidated Appropriations Act, 1997, and not as part of the Immigration and Nationality Act which comprises this chapter. Statutory Notes and Related Subsidiaries Abolition of Immigration and Naturalization Service and Transfer of Functions For abolition of Immigration and Naturalization Service, transfer of functions, and treatment of related references, see note set out under section 1551 of this title. U.S. Code Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities How current is this? Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/8/1373",
    "jurisdiction": "us_federal",
    "legal_domain": "immigration_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal immigration statutes",
      "search_rank": 3,
      "snippet": "8 U.S. Code § 1373 - Communication between government agencies and the Immigration and Naturalization Service ; (1). Sending such information to, or requesting ..."
    },
    "created_at": "2025-08-01T17:04:37.879809",
    "content_hash": "6c55d6aab6d221d36cc38d3e79ee9e42"
  },
  {
    "id": "search_us_federal_statute_3_1754067878",
    "title": "U.S. Code: Title 8 — ALIENS AND NATIONALITY | US Law",
    "content": "U.S. Code: Title 8 — ALIENS AND NATIONALITY | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 8 Quick search by citation: Title Section Go! U.S. Code: Title 8 — ALIENS AND NATIONALITY U.S. Code prev | next CHAPTER 1—GENERAL PROVISIONS (§ 1) CHAPTER 2—ELECTIVE FRANCHISE (§ 31) CHAPTER 3—CIVIL RIGHTS (§§ 41 – 53) CHAPTER 4—FREEDMEN (§ 61) CHAPTER 5—ALIEN OWNERSHIP OF LAND (§§ 71 – 83) CHAPTER 6—IMMIGRATION (§§ 100 – 241) CHAPTER 7—EXCLUSION OF CHINESE (§§ 261 – 299) CHAPTER 8—THE COOLY TRADE (§ 331) CHAPTER 9—MISCELLANEOUS PROVISIONS (§ 351) CHAPTER 10—ALIEN REGISTRATION (§ 451) CHAPTER 11—NATIONALITY (§§ 501 – 1001) CHAPTER 12—IMMIGRATION AND NATIONALITY (§§ 1101 – 1537) CHAPTER 13—IMMIGRATION AND NATURALIZATION SERVICE (§§ 1551 – 1574) CHAPTER 14—RESTRICTING WELFARE AND PUBLIC BENEFITS FOR ALIENS (§§ 1601 – 1646) CHAPTER 15—ENHANCED BORDER SECURITY AND VISA ENTRY REFORM (§§ 1701 – 1778) U.S. Code Toolbox Law about... Articles from Wex Table of Popular Names Parallel Table of Authorities How current is this? Accessibility About LII Contact us Advertise here Help Terms of use Privacy",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/8",
    "jurisdiction": "us_federal",
    "legal_domain": "immigration_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal immigration statutes",
      "search_rank": 4,
      "snippet": "Title 8 covers general provisions, alien ownership of land, immigration, exclusion of Chinese, alien registration, nationality, and restricting welfare for ..."
    },
    "created_at": "2025-08-01T17:04:38.059600",
    "content_hash": "beb6d6a12767fc7c8e994206f1ef3c4c"
  },
  {
    "id": "search_us_federal_statute_4_1754067879",
    "title": "8 U.S. Code § 1101 - Definitions | LII / Legal Information Institute",
    "content": "8 U.S. Code § 1101 - Definitions | U.S. Code | US Law | LII / Legal Information Institute Please help us improve our site! × No thank you Skip to main content Cornell Law School Search Cornell Toggle navigation Please help us improve our site! Support Us! Search About LII Who We Are What We Do Who Pays For This Contact Us Get the law Constitution Supreme Court U.S. Code CFR Federal Rules Federal Rules of Appellate Procedure Federal Rules of Civil Procedure Federal Rules of Criminal Procedure Federal Rules of Evidence Federal Rules of Bankruptcy Procedure U.C.C. Law by jurisdiction State law Uniform laws Federal law World law Lawyer directory Legal encyclopedia Business law Constitutional law Criminal law Family law Employment law Money and Finances More... Help out Give Sponsor Advertise Create Promote Join Lawyer Directory LII U.S. Code Title 8 CHAPTER 12 SUBCHAPTER I § 1101 Quick search by citation: Title Section Go! 8 U.S. Code § 1101 - Definitions U.S. Code Notes Authorities (CFR) prev | next (a) As used in this chapter— (1) The term “administrator” means the official designated by the Secretary of State pursuant to section 1104(b) of this title. (2) The term “advocates” includes, but is not limited to, advises, recommends, furthers by overt act, and admits belief in. (3) The term “alien” means any person not a citizen or national of the United States. (4) The term “application for admission” has reference to the application for admission into the United States and not to the application for the issuance of an immigrant or nonimmigrant visa. (5) The term “Attorney General” means the Attorney General of the United States. (6) The term “border crossing identification card” means a document of identity bearing that designation issued to an alien who is lawfully admitted for permanent residence, or to an alien who is a resident in foreign contiguous territory, by a consular officer or an immigration officer for the purpose of crossing over the borders between the United States and foreign contiguous territory in accordance with such conditions for its issuance and use as may be prescribed by regulations. Such regulations shall provide that (A) each such document include a biometric identifier (such as the fingerprint or handprint of the alien) that is machine readable and (B) an alien presenting a border crossing identification card is not permitted to cross over the border into the United States unless the biometric identifier contained on the card matches the appropriate biometric characteristic of the alien. (7) The term “clerk of court” means a clerk of a naturalization court. (8) The terms “Commissioner” and “Deputy Commissioner” mean the Commissioner of Immigration and Naturalization and a Deputy Commissioner of Immigration and Naturalization, respectively. (9) The term “consular officer” means any consular, diplomatic, or other officer or employee of the United States designated under regulations prescribed under authority contained in this chapter, for the purpose of issuing immigrant or nonimmigrant visas or, when used in subchapter III, for the purpose of adjudicating nationality. (10) The term “crewman” means a person serving in any capacity on board a vessel or aircraft. (11) The term “diplomatic visa” means a nonimmigrant visa bearing that title and issued to a nonimmigrant in accordance with such regulations as the Secretary of State may prescribe. (12) The term “doctrine” includes, but is not limited to, policies, practices, purposes, aims, or procedures. (13) (A) The terms “admission” and “admitted” mean, with respect to an alien, the lawful entry of the alien into the United States after inspection and authorization by an immigration officer. (B) An alien who is paroled under section 1182(d)(5) of this title or permitted to land temporarily as an alien crewman shall not be considered to have been admitted. (C) An alien lawfully admitted for permanent residence in the United States shall not be regarded as seeking an admission into the United States for purposes of the immigration laws unless the alien— (i) has abandoned or relinquished that status, (ii) has been absent from the United States for a continuous period in excess of 180 days, (iii) has engaged in illegal activity after having departed the United States, (iv) has departed from the United States while under legal process seeking removal of the alien from the United States, including removal proceedings under this chapter and extradition proceedings, (v) has committed an offense identified in section 1182(a)(2) of this title, unless since such offense the alien has been granted relief under section 1182(h) or 1229b(a) of this title, or (vi) is attempting to enter at a time or place other than as designated by immigration officers or has not been admitted to the United States after inspection and authorization by an immigration officer. (14) The term “foreign state” includes outlying possessions of a foreign state, but self-governin...",
    "source": "Web Search",
    "source_url": "https://www.law.cornell.edu/uscode/text/8/1101",
    "jurisdiction": "us_federal",
    "legal_domain": "immigration_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:law.cornell.edu federal immigration statutes",
      "search_rank": 5,
      "snippet": "The term “immigration laws” includes this chapter and all laws, conventions, and treaties of the United States relating to the immigration, exclusion, ..."
    },
    "created_at": "2025-08-01T17:04:39.209348",
    "content_hash": "95ac4d1424218fb7fb4468eecd3bf65d"
  },
  {
    "id": "search_us_california_statute_0_1754067886",
    "title": "https://leginfo.legislature.ca.gov/faces/codes_dis...",
    "content": "Codes Display Text skip to content home accessibility FAQ feedback sitemap login x Quick Search: Bill Number Bill Keyword Home Bill Information California Law Publications Other Resources My Subscriptions My Favorites California Law >> >> Code Section Group Code Section Group Code: Select Code CONS BPC CIV CCP COM CORP EDC ELEC EVID FAM FIN FGC FAC GOV HNC HSC INS LAB MVC PEN PROB PCC PRC PUC RTC SHC UIC VEH WAT WIC Article:Section: Code: Select Code All BPC CIV CCP COM CORP EDC ELEC EVID FAM FIN FGC FAC GOV HNC HSC INS LAB MVC PEN PROB PCC PRC PUC RTC SHC UIC VEH WAT WIC Section: Keyword(s): Code Search Text Search Up^Add To My Favorites Code Text CIVCivil Code - CIV1",
    "source": "Web Search",
    "source_url": "https://leginfo.legislature.ca.gov/faces/codes_displayText.xhtml?lawCode=CIV&division=3.&title=1.9.&part=4.&chapter=2.&article=1",
    "jurisdiction": "us_california",
    "legal_domain": "contract_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:leginfo.legislature.ca.gov California contract law",
      "search_rank": 1,
      "snippet": "No information is available for this page."
    },
    "created_at": "2025-08-01T17:04:46.510375",
    "content_hash": "a0ae36baeda9c5f7b1737657a8050dea"
  },
  {
    "id": "search_us_california_statute_0_1754067888",
    "title": "Labor Code - California Legislative Information",
    "content": "California Codes: Codes Tree - Labor Code - LAB skip to content home accessibility FAQ feedback sitemap login x Quick Search: Bill Number Bill Keyword Home Bill Information California Law Publications Other Resources My Subscriptions My Favorites California Law >> Code Search >> LAB LAB Code: Select Code Article:Section: Code: Select Code All BPC CIV CCP COM CORP EDC ELEC EVID FAM FIN FGC FAC GOV HNC HSC INS LAB MVC PEN PROB PCC PRC PUC RTC SHC UIC VEH WAT WIC Section: Keyword(s): Code Search Text Search Expand all Labor Code - LAB GENERAL PROVISIONS DIVISION 1. DEPARTMENT OF INDUSTRIAL RELATIONS [50 - 182] DIVISION 2. EMPLOYMENT REGULATION AND SUPERVISION [200 - 2699.8] DIVISION 3. EMPLOYMENT RELATIONS [2700 - 3122.4] DIVISION 4. WORKERS' COMPENSATION AND INSURANCE [3200 - 6002] DIVISION 4.5. WORKERS' COMPENSATION AND INSURANCE: STATE EMPLOYEES NOT OTHERWISE COVERED [6100 - 6149] DIVISION 4.7. RETRAINING AND REHABILITATION [6200 - 6208] DIVISION 5. SAFETY IN EMPLOYMENT [6300 - 9254] DIVISION 6. The Promote Ownership by Workers for Economic Recovery Act [10000 - 10010]",
    "source": "Web Search",
    "source_url": "https://leginfo.legislature.ca.gov/faces/codesTOCSelected.xhtml?tocCode=LAB&tocTitle=+Labor+Code+-+LAB",
    "jurisdiction": "us_california",
    "legal_domain": "employment_labor_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:leginfo.legislature.ca.gov California employment law",
      "search_rank": 1,
      "snippet": "No information is available for this page."
    },
    "created_at": "2025-08-01T17:04:48.042246",
    "content_hash": "02a1b737f45758cc09488948e562d139"
  },
  {
    "id": "search_us_california_statute_1_1754067888",
    "title": "Assembly Bill No. 5",
    "content": "The bill would provide that the factors of the “ABC” test be applied in order to determine the status of a worker as an employee or independent contractor for ...",
    "source": "Web Search",
    "source_url": "https://www.leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=201920200AB5&version=20190AB596AMD",
    "jurisdiction": "us_california",
    "legal_domain": "employment_labor_law",
    "document_type": "statute",
    "metadata": {
      "search_query": "site:leginfo.legislature.ca.gov California employment law",
      "search_rank": 2,
      "snippet": "The bill would provide that the factors of the “ABC” test be applied in order to determine the status of a worker as an employee or independent contractor for ..."
    },
    "created_at": "2025-08-01T17:04:48.307573",
    "content_hash": "f0040b05cfdad0d71498f2e8b856fc85"
  }
]